{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2021-033.pdf"
  },
  "title": "UPDATE: Vulnerabilities in Microsoft Print Spooler",
  "serial_number": "2021-033",
  "publish_date": "30-06-2021 15:19:00",
  "description": "On the 8th of June 2021, Microsoft - as part of the Patch Tuesday release - has issued updates that addressed multiple vulnerabilities including the Windows Print Spooler Remote Code Execution Vulnerability CVE-2021-1675 with CVSS score 7.8. This vulnerability was initially rated as a low-importance elevation-of-privilege vulnerability, but on the 21st of June Microsoft reviewed the issue and labeled it as a remote code execution flaw. Proof-of-concept exploit code for the CVE-2021-1675 flaw has been published online, the flaw impacts the Windows Print Spooler service and could be exploited to compromise Windows systems ([2] the Github page is not available anymore). On the 30th of June 2021, further analysis proved that the exploit - nicknamed PrintNightmare - still works on a fully patched domain controller or systems that have the Point and Print configured with the \"NoWarningNoElevationOnInstall\" option configured.<br>On the 2nd of July 2021, Microsoft announced a second vulnerability - CVE-2021-34527 - related to PrintNightmare remote code execution. This vulnerability is similar, but distinct from the vulnerability that is assigned CVE-2021-1675. On the 6th of July 2021, Microsoft released an update for several versions of Windows to address this new vulnerability. Updates are not yet available for Windows 10 version 1607, Windows Server 2016, or Windows Server 2012. On the 7th of July 2021, Microsoft released the updates for Windows Server 2012, Windows Server 2016 and Windows 10, Version 1607 versions.<br>On the 14th of July 2021, Microsoft announced a third vulnerability: CVE-2021-34481 with a CVSS base score of 7.8. The researcher who discovered this flaw does not consider it to be a variant of PrintNightmare. Nevertheless it is also related to Microsoft Print Spooler.<br>Despite the updates provided by Microsoft in July, various security researchers still found possibilities to exploit the Point and Print feature to install malicious print drivers that allowed low-privileged users to gain SYSTEM privileges in Windows.<br>On the 10th of August, Microsoft released new updates that fix CVE-2021-34481. These updates, and later ones, will require, by default, administrative privilege to install drivers.<br>On the 11th of August, Microsoft updated the CVSS score of the CVE-2021-34481 from 7.8 to 8.8. Microsoft discovered a remote path to exploit this vulnerability that was, at first, local. On the same day, Microsoft issued an advisory about this a vulnerability named CVE-2021-36958.<br>As part of September 2021 Patch Tuesday, Microsoft has released a new security update that fixes CVE-2021-36958. However, networking printing problems were reported from the community after deploying the patches.",
  "url_title": "2021-033",
  "content_markdown": "---\ntitle: 'Vulnerabilities in Microsoft Print Spooler'\nversion: '1.7'\nnumber: '2021-033'\ndate: 'September 17, 2021'\n---\n\n_History:_\n\n* _30/06/2021 --- v1.0 -- Initial publication_\n* _01/07/2021 --- v1.1 -- Update with information about issues with the patch_\n* _02/07/2021 --- v1.2 -- Update with information about new vulnerability_\n* _07/07/2021 --- v1.3 -- Update with information about new patch_\n* _08/07/2021 --- v1.4 -- Update with information about issues with the new patch_\n* _16/07/2021 --- v1.5 -- Update with information about a third vulnerability_\n* _13/08/2021 --- v1.6 -- Update with information about a fourth vulnerability and updates_\n* _17/09/2021 --- v1.7 -- Update with information about new patch_\n\n# Summary\n\nOn the 8th of June 2021, Microsoft -- as part of the Patch Tuesday release -- has issued updates that addressed multiple vulnerabilities including the Windows Print Spooler Remote Code Execution Vulnerability CVE-2021-1675 with CVSS score 7.8. This vulnerability was initially rated as a low-importance elevation-of-privilege vulnerability, but on the 21st of June Microsoft reviewed the issue and labeled it as a remote code execution flaw [1]. Proof-of-concept exploit code for the CVE-2021-1675 flaw has been published online, the flaw impacts the Windows Print Spooler service and could be exploited to compromise Windows systems ([2] the Github page is not available anymore). On the 30th of June 2021, further analysis proved that the exploit - nicknamed _PrintNightmare_ - still works on a fully patched domain controller or systems that have the Point and Print configured with the `NoWarningNoElevationOnInstall` option configured [3].\n\nOn the 2nd of July 2021, Microsoft announced a second vulnerability -- CVE-2021-34527 -- related to PrintNightmare remote code execution. This vulnerability is similar, but distinct from the vulnerability that is assigned CVE-2021-1675. On the 6th of July 2021, Microsoft released an update for several versions of Windows to address this new vulnerability. Updates are not yet available for Windows 10 version 1607, Windows Server 2016, or Windows Server 2012. On the 7th of July 2021, Microsoft released the updates for Windows Server 2012, Windows Server 2016 and Windows 10, Version 1607 versions [5].\n\nOn the 14th of July 2021, Microsoft announced a third vulnerability: CVE-2021-34481 with a CVSS base score of 7.8. The researcher who discovered this flaw does not consider it to be a variant of PrintNightmare [7]. Nevertheless it is also related to Microsoft Print Spooler.\n\nDespite the updates provided by Microsoft in July, various security researchers still found possibilities to exploit the Point and Print feature to install malicious print drivers that allowed low-privileged users to gain SYSTEM privileges in Windows. [9]\n\nOn the 10th of August, Microsoft released new updates that fix CVE-2021-34481 [10]. These updates, and later ones, will require, by default, administrative privilege to install drivers.\n\nOn the 11th of August, Microsoft updated the CVSS score of the CVE-2021-34481 from 7.8 to 8.8 [8]. Microsoft discovered a remote path to exploit this vulnerability that was, at first, local. On the same day, Microsoft issued an advisory about this a vulnerability named CVE-2021-36958 [11].\n\nAs part of September 2021 Patch Tuesday, Microsoft has released a new security update that fixes CVE-2021-36958 [12]. However, networking printing problems were reported from the community after deploying the patches [14].\n\n# Technical Details\n\nExploitation of CVE-2021-1675 could give remote attackers full control of vulnerable systems. To achieve RCE, attackers would need to target a user authenticated to the spooler service. Without authentication, the flaw could be exploited to elevate privileges, making this vulnerability a valuable link in an attack chain.\n\nThe vulnerability resides in the authentication process of `RpcAddPrinterDriver`. A normal user can bypass this authentication and install a malicious driver in the print server. In a domain, a normal domain user can connect to the Spooler service in the domain controller and install a driver into the DC. Then, he can execute code as `SYSTEM` on the domain controller and fully control the Domain.\n\nAs per CVE-2021-34527 the vulnerability is in the same function, `RpcAddPrinterDriverEx` and an attack must involve an authenticated user. The remote code execution vulnerability exists when the Windows Print Spooler service improperly performs privileged file operations. An attacker who successfully exploited this vulnerability could run arbitrary code with `SYSTEM` privileges. An attacker could then install programs; view, change, delete data; or create new accounts with full user rights.\n\nFor CVE-2021-34527, Microsoft advised about additional settings that should be checked in order to secure the system. The _Point and Print_ registry settings are not directly related to this vulnerability, but this technology weakens the local security posture in such a way that exploitation will still be possible [5]. More details on how to mitigate this can be found in the [Recommendations] section.\n\nCVE-2021-34481, when exploited, allows for local privilege escalation to the level of SYSTEM and an attacker could then install programs, view, change, delete data or create new accounts with full user rights. To exploit this vulnerability an attacker must have the ability to execute code on a victim system. However, on the 11th of August, Microsoft discovered a remote path to exploit this vulnerability.\n\nThe CVE-2021-36958 vulnerability exists when the Windows Print Spooler service improperly performs privileged file operations [12]. An attacker who successfully exploited this vulnerability could run arbitrary code with SYSTEM privileges. An attacker could then install programs; view, change, delete data; or create new accounts with full user rights. While Microsoft classifies this vulnerability as Remote Code Execution, the attack needs to be performed locally, according to researchers [11].\n\n# Affected Products\n\n* Windows Server 2016\n* Windows Server 2019\n* Windows Server 2012 (including R2)\n* Windows Server 2008 (including R2, R2 SP1 and R2 SP2)\n* Windows 7, 8.1 and 10 (including versions 1909)\n* Windows Server, version 2004\n* Windows Server, version 20H2\n\n# Recommendations\n\n**Apply the patches as soon as possible.** CVE-2021-1675 was fully patched as part of Microsoft’s Patch Tuesday release on June 8, 2021 [1], and CVE-2021-34527 was patched with a security patch that can be found on the vendor's advisory site [5]. The CVE-2021-34481 was patched as part of Microsoft Patch Tuesday release on August 10, 2021 [8].\n\nFinally, in September 2021 Patch Tuesday security updates, Microsoft has released a new security update for CVE-2021-36958 that fixes the remaining PrintNightmare vulnerability [13]. However, Windows administrators report wide-scale network printing problems [14]. Testing before deploying the last patches should be taken into consideration especially for the following updates:\n\n- KB5005568 (Windows Server 2019)\n- KB5005613 (Windows Server 2012 R2)\n- KB5005627 (Windows Server 2012 R2)\n- KB5005623 (Windows Server 2012)\n- KB5005607 (Windows Server 2012)\n- KB5005606 (Windows Server 2008)\n- KB5005618 (Windows Server 2008)\n- KB5005565 (Windows 10 2004, 20H2, and 21H1)\n- KB5005566 (Windows 10 1909)\n- KB5005615 (Windows 7 Windows Server 2008 R2)\n\n**Additionally**, for CVE-2021-34527, it must be confirmed that the following registry settings are set to `0` (zero) or are not defined [5]:\n\n\tHKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Printers\\PointAndPrint\n\n- `NoWarningNoElevationOnInstall = 0 (DWORD)` or not defined (default setting)\n- `NoWarningNoElevationOnUpdate = 0 (DWORD)` or not defined (default setting)\n\n\n**Note:** Having `NoWarningNoElevationOnInstall` set to `1` makes your system vulnerable by design. These registry keys do not exist by default, and therefore are already at the secure setting.\n\n**Optionally**, configure the `RestrictDriverInstallationToAdministrators` registry value to prevent non-administrators from installing printer drivers on a print server. Therefore, after the Microsoft update for CVE-2021-34527 is installed, a registry value called `RestrictDriverInstallationToAdministrators` in the key:\n\n\tHKLM\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Printers\\PointAndPrint\\\n\nshould be checked. It is intended to restrict printer driver installation to only administrator users. Please see KB5005010 for more details [6].\n\n## Mitigation\n\nIn case the patches cannot be applied, the workaround is to disable the Spooler service [5]. It is described how to do it on both GPO and PowerShell in [4]. This should be done after a careful analysis of the impact.\n\nAnother option is to disable inbound remote printing through Group Policy. These settings can also be configured via Group Policy as follows:\n\n- _Computer Configuration_ / _Administrative Templates_ / _Printers_\n- Disable the _Allow Print Spooler to accept client connections_ policy to block remote attacks.\n\nThe impact of this workaround is that this policy will block the remote attack vector by preventing inbound remote printing operations. The system will no longer function as a print server, but local printing to a directly attached device will still be possible [5].\n\nRegarding CVE-2021-36958, Microsoft recommends disabling the Print Spooler [12] - this will disable the ability to print both locally and remotely. However, other \"non-official\" mitigations exist that do not involve  disabling the Print Spooler. It consists in allowing devices to install printers only from authorised servers [11]. This can be set up via Group Policy as follows:\n\n- _User Configuration_ / _Administrative Templates_ / _Control Panel > Printers_ / _Package Point and Print – Approved Servers._\n- Then, enter the list of allowed print servers. If there is no print server on the network, a fake server can be set to enable the feature.\n\nUsing this group policy will provide the best protection against CVE-2021-36958 exploits but will not prevent threat actors from taking over an authorised print server with malicious drivers.\n\n# References\n\n[1] <https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-1675>\n\n[2] <https://github.com/afwu/PrintNightmare> (not available anymore)\n\n[3] <https://www.kb.cert.org/vuls/id/383432>\n\n[4] <https://github.com/LaresLLC/CVE-2021-1675>\n\n[5] <https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527>\n\n[6] <https://support.microsoft.com/en-us/topic/kb5005010-restricting-installation-of-new-printer-drivers-after-applying-the-july-6-2021-updates-31b91c02-05bc-4ada-a7ea-183b129578a7>\n\n[7] <https://twitter.com/Junior_Baines>\n\n[8] <https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34481>\n\n[9] <https://www.bleepingcomputer.com/news/microsoft/windows-print-nightmare-continues-with-malicious-driver-packages/>\n\n[10] <https://support.microsoft.com/en-us/topic/kb5005652-manage-new-point-and-print-default-driver-installation-behavior-cve-2021-34481-873642bf-2634-49c5-a23b-6d8e9a302872>\n\n[11] <https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-another-windows-print-spooler-zero-day-bug/>\n\n[12] <https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36958>\n\n[13] <https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-remaining-windows-printnightmare-vulnerabilities/>\n\n[14] <https://www.bleepingcomputer.com/news/security/new-windows-security-updates-break-network-printing/>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>30/06/2021 --- v1.0 -- Initial publication</em></li><li><em>01/07/2021 --- v1.1 -- Update with information about issues with the patch</em></li><li><em>02/07/2021 --- v1.2 -- Update with information about new vulnerability</em></li><li><em>07/07/2021 --- v1.3 -- Update with information about new patch</em></li><li><em>08/07/2021 --- v1.4 -- Update with information about issues with the new patch</em></li><li><em>16/07/2021 --- v1.5 -- Update with information about a third vulnerability</em></li><li><em>13/08/2021 --- v1.6 -- Update with information about a fourth vulnerability and updates</em></li><li><em>17/09/2021 --- v1.7 -- Update with information about new patch</em></li></ul><h2 id=\"summary\">Summary</h2><p>On the 8th of June 2021, Microsoft -- as part of the Patch Tuesday release -- has issued updates that addressed multiple vulnerabilities including the Windows Print Spooler Remote Code Execution Vulnerability CVE-2021-1675 with CVSS score 7.8. This vulnerability was initially rated as a low-importance elevation-of-privilege vulnerability, but on the 21st of June Microsoft reviewed the issue and labeled it as a remote code execution flaw [1]. Proof-of-concept exploit code for the CVE-2021-1675 flaw has been published online, the flaw impacts the Windows Print Spooler service and could be exploited to compromise Windows systems ([2] the Github page is not available anymore). On the 30th of June 2021, further analysis proved that the exploit - nicknamed <em>PrintNightmare</em> - still works on a fully patched domain controller or systems that have the Point and Print configured with the <code>NoWarningNoElevationOnInstall</code> option configured [3].</p><p>On the 2nd of July 2021, Microsoft announced a second vulnerability -- CVE-2021-34527 -- related to PrintNightmare remote code execution. This vulnerability is similar, but distinct from the vulnerability that is assigned CVE-2021-1675. On the 6th of July 2021, Microsoft released an update for several versions of Windows to address this new vulnerability. Updates are not yet available for Windows 10 version 1607, Windows Server 2016, or Windows Server 2012. On the 7th of July 2021, Microsoft released the updates for Windows Server 2012, Windows Server 2016 and Windows 10, Version 1607 versions [5].</p><p>On the 14th of July 2021, Microsoft announced a third vulnerability: CVE-2021-34481 with a CVSS base score of 7.8. The researcher who discovered this flaw does not consider it to be a variant of PrintNightmare [7]. Nevertheless it is also related to Microsoft Print Spooler.</p><p>Despite the updates provided by Microsoft in July, various security researchers still found possibilities to exploit the Point and Print feature to install malicious print drivers that allowed low-privileged users to gain SYSTEM privileges in Windows. [9]</p><p>On the 10th of August, Microsoft released new updates that fix CVE-2021-34481 [10]. These updates, and later ones, will require, by default, administrative privilege to install drivers.</p><p>On the 11th of August, Microsoft updated the CVSS score of the CVE-2021-34481 from 7.8 to 8.8 [8]. Microsoft discovered a remote path to exploit this vulnerability that was, at first, local. On the same day, Microsoft issued an advisory about this a vulnerability named CVE-2021-36958 [11].</p><p>As part of September 2021 Patch Tuesday, Microsoft has released a new security update that fixes CVE-2021-36958 [12]. However, networking printing problems were reported from the community after deploying the patches [14].</p><h2 id=\"technical-details\">Technical Details</h2><p>Exploitation of CVE-2021-1675 could give remote attackers full control of vulnerable systems. To achieve RCE, attackers would need to target a user authenticated to the spooler service. Without authentication, the flaw could be exploited to elevate privileges, making this vulnerability a valuable link in an attack chain.</p><p>The vulnerability resides in the authentication process of <code>RpcAddPrinterDriver</code>. A normal user can bypass this authentication and install a malicious driver in the print server. In a domain, a normal domain user can connect to the Spooler service in the domain controller and install a driver into the DC. Then, he can execute code as <code>SYSTEM</code> on the domain controller and fully control the Domain.</p><p>As per CVE-2021-34527 the vulnerability is in the same function, <code>RpcAddPrinterDriverEx</code> and an attack must involve an authenticated user. The remote code execution vulnerability exists when the Windows Print Spooler service improperly performs privileged file operations. An attacker who successfully exploited this vulnerability could run arbitrary code with <code>SYSTEM</code> privileges. An attacker could then install programs; view, change, delete data; or create new accounts with full user rights.</p><p>For CVE-2021-34527, Microsoft advised about additional settings that should be checked in order to secure the system. The <em>Point and Print</em> registry settings are not directly related to this vulnerability, but this technology weakens the local security posture in such a way that exploitation will still be possible [5]. More details on how to mitigate this can be found in the [Recommendations] section.</p><p>CVE-2021-34481, when exploited, allows for local privilege escalation to the level of SYSTEM and an attacker could then install programs, view, change, delete data or create new accounts with full user rights. To exploit this vulnerability an attacker must have the ability to execute code on a victim system. However, on the 11th of August, Microsoft discovered a remote path to exploit this vulnerability.</p><p>The CVE-2021-36958 vulnerability exists when the Windows Print Spooler service improperly performs privileged file operations [12]. An attacker who successfully exploited this vulnerability could run arbitrary code with SYSTEM privileges. An attacker could then install programs; view, change, delete data; or create new accounts with full user rights. While Microsoft classifies this vulnerability as Remote Code Execution, the attack needs to be performed locally, according to researchers [11].</p><h2 id=\"affected-products\">Affected Products</h2><ul><li>Windows Server 2016</li><li>Windows Server 2019</li><li>Windows Server 2012 (including R2)</li><li>Windows Server 2008 (including R2, R2 SP1 and R2 SP2)</li><li>Windows 7, 8.1 and 10 (including versions 1909)</li><li>Windows Server, version 2004</li><li>Windows Server, version 20H2</li></ul><h2 id=\"recommendations\">Recommendations</h2><p><strong>Apply the patches as soon as possible.</strong> CVE-2021-1675 was fully patched as part of Microsoft’s Patch Tuesday release on June 8, 2021 [1], and CVE-2021-34527 was patched with a security patch that can be found on the vendor's advisory site [5]. The CVE-2021-34481 was patched as part of Microsoft Patch Tuesday release on August 10, 2021 [8].</p><p>Finally, in September 2021 Patch Tuesday security updates, Microsoft has released a new security update for CVE-2021-36958 that fixes the remaining PrintNightmare vulnerability [13]. However, Windows administrators report wide-scale network printing problems [14]. Testing before deploying the last patches should be taken into consideration especially for the following updates:</p><ul><li>KB5005568 (Windows Server 2019)</li><li>KB5005613 (Windows Server 2012 R2)</li><li>KB5005627 (Windows Server 2012 R2)</li><li>KB5005623 (Windows Server 2012)</li><li>KB5005607 (Windows Server 2012)</li><li>KB5005606 (Windows Server 2008)</li><li>KB5005618 (Windows Server 2008)</li><li>KB5005565 (Windows 10 2004, 20H2, and 21H1)</li><li>KB5005566 (Windows 10 1909)</li><li>KB5005615 (Windows 7 Windows Server 2008 R2)</li></ul><p><strong>Additionally</strong>, for CVE-2021-34527, it must be confirmed that the following registry settings are set to <code>0</code> (zero) or are not defined [5]:</p><pre><code>HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Printers\\PointAndPrint\n</code></pre><ul><li><code>NoWarningNoElevationOnInstall = 0 (DWORD)</code> or not defined (default setting)</li><li><code>NoWarningNoElevationOnUpdate = 0 (DWORD)</code> or not defined (default setting)</li></ul><p><strong>Note:</strong> Having <code>NoWarningNoElevationOnInstall</code> set to <code>1</code> makes your system vulnerable by design. These registry keys do not exist by default, and therefore are already at the secure setting.</p><p><strong>Optionally</strong>, configure the <code>RestrictDriverInstallationToAdministrators</code> registry value to prevent non-administrators from installing printer drivers on a print server. Therefore, after the Microsoft update for CVE-2021-34527 is installed, a registry value called <code>RestrictDriverInstallationToAdministrators</code> in the key:</p><pre><code>HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Printers\\PointAndPrint\\\n</code></pre><p>should be checked. It is intended to restrict printer driver installation to only administrator users. Please see KB5005010 for more details [6].</p><h3 id=\"mitigation\">Mitigation</h3><p>In case the patches cannot be applied, the workaround is to disable the Spooler service [5]. It is described how to do it on both GPO and PowerShell in [4]. This should be done after a careful analysis of the impact.</p><p>Another option is to disable inbound remote printing through Group Policy. These settings can also be configured via Group Policy as follows:</p><ul><li><em>Computer Configuration</em> / <em>Administrative Templates</em> / <em>Printers</em></li><li>Disable the <em>Allow Print Spooler to accept client connections</em> policy to block remote attacks.</li></ul><p>The impact of this workaround is that this policy will block the remote attack vector by preventing inbound remote printing operations. The system will no longer function as a print server, but local printing to a directly attached device will still be possible [5].</p><p>Regarding CVE-2021-36958, Microsoft recommends disabling the Print Spooler [12] - this will disable the ability to print both locally and remotely. However, other \"non-official\" mitigations exist that do not involve disabling the Print Spooler. It consists in allowing devices to install printers only from authorised servers [11]. This can be set up via Group Policy as follows:</p><ul><li><em>User Configuration</em> / <em>Administrative Templates</em> / <em>Control Panel &gt; Printers</em> / <em>Package Point and Print – Approved Servers.</em></li><li>Then, enter the list of allowed print servers. If there is no print server on the network, a fake server can be set to enable the feature.</li></ul><p>Using this group policy will provide the best protection against CVE-2021-36958 exploits but will not prevent threat actors from taking over an authorised print server with malicious drivers.</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-1675\">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-1675</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/afwu/PrintNightmare\">https://github.com/afwu/PrintNightmare</a> (not available anymore)</p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.kb.cert.org/vuls/id/383432\">https://www.kb.cert.org/vuls/id/383432</a></p><p>[4] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/LaresLLC/CVE-2021-1675\">https://github.com/LaresLLC/CVE-2021-1675</a></p><p>[5] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527\">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527</a></p><p>[6] <a rel=\"noopener\" target=\"_blank\" href=\"https://support.microsoft.com/en-us/topic/kb5005010-restricting-installation-of-new-printer-drivers-after-applying-the-july-6-2021-updates-31b91c02-05bc-4ada-a7ea-183b129578a7\">https://support.microsoft.com/en-us/topic/kb5005010-restricting-installation-of-new-printer-drivers-after-applying-the-july-6-2021-updates-31b91c02-05bc-4ada-a7ea-183b129578a7</a></p><p>[7] <a rel=\"noopener\" target=\"_blank\" href=\"https://twitter.com/Junior_Baines\">https://twitter.com/Junior_Baines</a></p><p>[8] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34481\">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34481</a></p><p>[9] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.bleepingcomputer.com/news/microsoft/windows-print-nightmare-continues-with-malicious-driver-packages/\">https://www.bleepingcomputer.com/news/microsoft/windows-print-nightmare-continues-with-malicious-driver-packages/</a></p><p>[10] <a rel=\"noopener\" target=\"_blank\" href=\"https://support.microsoft.com/en-us/topic/kb5005652-manage-new-point-and-print-default-driver-installation-behavior-cve-2021-34481-873642bf-2634-49c5-a23b-6d8e9a302872\">https://support.microsoft.com/en-us/topic/kb5005652-manage-new-point-and-print-default-driver-installation-behavior-cve-2021-34481-873642bf-2634-49c5-a23b-6d8e9a302872</a></p><p>[11] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-another-windows-print-spooler-zero-day-bug/\">https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-another-windows-print-spooler-zero-day-bug/</a></p><p>[12] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36958\">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36958</a></p><p>[13] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-remaining-windows-printnightmare-vulnerabilities/\">https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-remaining-windows-printnightmare-vulnerabilities/</a></p><p>[14] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.bleepingcomputer.com/news/security/new-windows-security-updates-break-network-printing/\">https://www.bleepingcomputer.com/news/security/new-windows-security-updates-break-network-printing/</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  },
  "cves": [
    "CVE-2021-1675",
    "CVE-2021-34481",
    "CVE-2021-34527",
    "CVE-2021-36958"
  ]
}