{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2023-018.pdf"
  },
  "title": "Microsoft Outlook Elevation of Privilege Vulnerability",
  "serial_number": "2023-018",
  "publish_date": "15-03-2023 10:30:00",
  "description": "On March 14, 2023, Microsoft released a security fix for an elevation of privilege vulnerability (CVE-2023-23397) in Microsoft Outlook. A specially crafted e-mail can trigger the vulnerability automatically when it is retrieved and processed by the Outlook client. Such an e-mail could lead to exploitation before the e-mail is viewed in the Preview Pane and allows an attacker to steal credential hashes by forcing the targets' devices to authenticate to an attacker-controlled server. The Computer Emergency Response Team for Ukraine (CERT-UA) reported the vulnerability to Microsoft. Based on Microsoft Threat Intelligence, a Russia-based threat actor used it in attacks to target and breach the network of several governments, military, energy, and transportation organisations in Europe between April and December 2022. They used the stolen hashes for lateral movement within the victims' networks and to change Outlook mailbox folder permissions for e-mail exfiltration. Online services such as Microsoft 365 do not support NTLM authentication and are not vulnerable to being attacked by these messages.",
  "url_title": "2023-018",
  "content_markdown": "--- \ntitle: 'Microsoft Outlook Elevation of Privilege Vulnerability'\nversion: '1.0'\nnumber: '2023-018'\noriginal_date: 'March 14, 2023'\ndate: 'March 15, 2023'\n---\n\n_History:_\n\n* _15/03/2023 --- v1.0 -- Initial publication_\n\n# Summary\n\nOn March 14, 2023, Microsoft released a security fix for an elevation of privilege vulnerability (`CVE-2023-23397`) in Microsoft Outlook [1]. A specially crafted e-mail can trigger the vulnerability automatically when it is retrieved and processed by the Outlook client. Such an e-mail could lead to exploitation **before** the e-mail is viewed in the Preview Pane and allows an attacker to steal credential hashes by forcing the targets' devices to authenticate to an attacker-controlled server [2]. \n\nThe Computer Emergency Response Team for Ukraine (CERT-UA) reported the vulnerability to Microsoft. Based on Microsoft Threat Intelligence, a Russia-based threat actor used it in attacks to target and breach the network of several governments, military, energy, and transportation organisations in Europe between April and December 2022 [2]. They used the stolen hashes for lateral movement within the victims' networks and to change Outlook mailbox folder permissions for e-mail exfiltration [3].\n  \nOnline services such as Microsoft 365 do not support NTLM authentication and are not vulnerable to being attacked by these messages.\n\n# Technical Details\n\nAn attacker can send a specially crafted e-mail to trigger the vulnerability automatically when it is retrieved and processed by the Outlook client. User interaction is not required to exploit the vulnerability.\n\nThe crafted message uses extended properties from Microsoft’s _Messaging Application Programming Interface_ (MAPI) containing _Universal Naming Convention_ (UNC) paths to an attacker-controlled _Server Message Block_ (SMB) share (using TCP port 445). The connection to the remote SMB server sends the user's _NT Lan Manager_ (NTLM) negotiation message, which the attacker can then relay for authentication against other systems that support NTLM authentication. Additionally, it is possible for attackers to brute-force NTLM hashes offline to recover the cleartext password for the account [4].\n\n# Affected Products\n\nAll supported versions of Microsoft Outlook for Windows are affected [1]:\n\nMicrosoft Outlook 2013, Microsoft Outlook 2016, Microsoft Outlook 2019, Microsoft Office LTSC 2021 and Microsoft 365 Apps for Enterprise.\n\n# Recommendations\n\nCERT-EU strongly recommends applying the latest patches for Microsoft Outlook.\n\n## Impact Assessment\n\nCERT-EU recommends determining if attackers targeted an organisation by auditing all Exchange message items since April 2022. For this purpose, Microsoft provides documentation and a PowerShell script [5]. The script will check tasks, e-mail messages, and calendar items for properties with UNC path directly on the Microsoft Exchange server (on premises and in the cloud). Organisations should review the output of this script to determine risk and act accordingly if any item is considered malicious. \n\nBe aware that CERT-EU recommends running the script in **audit mode** and not using the cleanup mode directly. The cleanup mode will destroy forensic evidence, and, in the most severe cases, data loss may occur.\n\n## Mitigations\n\nCERT-EU recommends firmly blocking TCP 445/SMB outbound from your network using a perimeter firewall, a local firewall, and your VPN settings. This approach will prevent sending NTLM authentication messages to remote file shares. This blocking rule should default in a perimeter firewall regardless of the current vulnerability.\n\nAdditionally, CERT-EU recommends adding high-value accounts, such as Domain Admins, to the Protected Users Security Group. This approach prevents using NTLM as an authentication mechanism. Performing this mitigation makes troubleshooting easier than other methods of disabling NTLM. However, this will **cause an impact** on applications that require NTLM authentication. Removing the user from the Protected Users Security Group will revert the settings. Please see Protected Users Security Group [6] for more information.\n\n# References\n\n[1] <https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-23397>\n\n[2] <https://msrc.microsoft.com/blog/2023/03/microsoft-mitigates-outlook-elevation-of-privilege-vulnerability/>\n\n[3] <https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-zero-day-used-by-russian-hackers-since-april-2022/>\n\n[4] <https://www.ired.team/offensive-security/initial-access/netntlmv2-hash-stealing-using-outlook>\n\n[5] <https://microsoft.github.io/CSS-Exchange/Security/CVE-2023-23397/>\n\n[6] <https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/protected-users-security-group>",
  "content_html": "<p><em>History:</em></p><ul><li><em>15/03/2023 --- v1.0 -- Initial publication</em></li></ul><h2 id=\"summary\">Summary</h2><p>On March 14, 2023, Microsoft released a security fix for an elevation of privilege vulnerability (<code>CVE-2023-23397</code>) in Microsoft Outlook [1]. A specially crafted e-mail can trigger the vulnerability automatically when it is retrieved and processed by the Outlook client. Such an e-mail could lead to exploitation <strong>before</strong> the e-mail is viewed in the Preview Pane and allows an attacker to steal credential hashes by forcing the targets' devices to authenticate to an attacker-controlled server [2]. </p><p>The Computer Emergency Response Team for Ukraine (CERT-UA) reported the vulnerability to Microsoft. Based on Microsoft Threat Intelligence, a Russia-based threat actor used it in attacks to target and breach the network of several governments, military, energy, and transportation organisations in Europe between April and December 2022 [2]. They used the stolen hashes for lateral movement within the victims' networks and to change Outlook mailbox folder permissions for e-mail exfiltration [3].</p><p>Online services such as Microsoft 365 do not support NTLM authentication and are not vulnerable to being attacked by these messages.</p><h2 id=\"technical-details\">Technical Details</h2><p>An attacker can send a specially crafted e-mail to trigger the vulnerability automatically when it is retrieved and processed by the Outlook client. User interaction is not required to exploit the vulnerability.</p><p>The crafted message uses extended properties from Microsoft’s <em>Messaging Application Programming Interface</em> (MAPI) containing <em>Universal Naming Convention</em> (UNC) paths to an attacker-controlled <em>Server Message Block</em> (SMB) share (using TCP port 445). The connection to the remote SMB server sends the user's <em>NT Lan Manager</em> (NTLM) negotiation message, which the attacker can then relay for authentication against other systems that support NTLM authentication. Additionally, it is possible for attackers to brute-force NTLM hashes offline to recover the cleartext password for the account [4].</p><h2 id=\"affected-products\">Affected Products</h2><p>All supported versions of Microsoft Outlook for Windows are affected [1]:</p><p>Microsoft Outlook 2013, Microsoft Outlook 2016, Microsoft Outlook 2019, Microsoft Office LTSC 2021 and Microsoft 365 Apps for Enterprise.</p><h2 id=\"recommendations\">Recommendations</h2><p>CERT-EU strongly recommends applying the latest patches for Microsoft Outlook.</p><h3 id=\"impact-assessment\">Impact Assessment</h3><p>CERT-EU recommends determining if attackers targeted an organisation by auditing all Exchange message items since April 2022. For this purpose, Microsoft provides documentation and a PowerShell script [5]. The script will check tasks, e-mail messages, and calendar items for properties with UNC path directly on the Microsoft Exchange server (on premises and in the cloud). Organisations should review the output of this script to determine risk and act accordingly if any item is considered malicious. </p><p>Be aware that CERT-EU recommends running the script in <strong>audit mode</strong> and not using the cleanup mode directly. The cleanup mode will destroy forensic evidence, and, in the most severe cases, data loss may occur.</p><h3 id=\"mitigations\">Mitigations</h3><p>CERT-EU recommends firmly blocking TCP 445/SMB outbound from your network using a perimeter firewall, a local firewall, and your VPN settings. This approach will prevent sending NTLM authentication messages to remote file shares. This blocking rule should default in a perimeter firewall regardless of the current vulnerability.</p><p>Additionally, CERT-EU recommends adding high-value accounts, such as Domain Admins, to the Protected Users Security Group. This approach prevents using NTLM as an authentication mechanism. Performing this mitigation makes troubleshooting easier than other methods of disabling NTLM. However, this will <strong>cause an impact</strong> on applications that require NTLM authentication. Removing the user from the Protected Users Security Group will revert the settings. Please see Protected Users Security Group [6] for more information.</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-23397\">https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-23397</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/blog/2023/03/microsoft-mitigates-outlook-elevation-of-privilege-vulnerability/\">https://msrc.microsoft.com/blog/2023/03/microsoft-mitigates-outlook-elevation-of-privilege-vulnerability/</a></p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-zero-day-used-by-russian-hackers-since-april-2022/\">https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-zero-day-used-by-russian-hackers-since-april-2022/</a></p><p>[4] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.ired.team/offensive-security/initial-access/netntlmv2-hash-stealing-using-outlook\">https://www.ired.team/offensive-security/initial-access/netntlmv2-hash-stealing-using-outlook</a></p><p>[5] <a rel=\"noopener\" target=\"_blank\" href=\"https://microsoft.github.io/CSS-Exchange/Security/CVE-2023-23397/\">https://microsoft.github.io/CSS-Exchange/Security/CVE-2023-23397/</a></p><p>[6] <a rel=\"noopener\" target=\"_blank\" href=\"https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/protected-users-security-group\">https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/protected-users-security-group</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  },
  "cves": [
    "CVE-2023-23397"
  ]
}