{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2023-006.pdf"
  },
  "title": "Critical Security Flaw in Jira Service Management Server and Data Center",
  "serial_number": "2023-006",
  "publish_date": "03-02-2023 18:20:00",
  "description": "A critical security flaw has been discovered in Jira Service Management Server and Data Center that can be exploited by an attacker to impersonate another user and gain unauthorized access to instances. The vulnerability is tracked as CVE-2023-22501 with a CVSS score of 9.4.",
  "url_title": "2023-006",
  "content_markdown": "---\ntitle: 'Critical Security Flaw in Jira Service Management Server and Data Center'\nversion: '1.0'\nnumber: '2023-006'\noriginal_date: 'February 1, 2023'\ndate: 'February 3, 2023'\n---\n\n_History:_\n\n* _03/02/2023 --- v1.0 -- Initial publication_\n\n# Summary\n\nA critical security flaw has been discovered in Jira Service Management Server and Data Center that can be exploited by an attacker to impersonate another user and gain unauthorized access to instances. The vulnerability is tracked as `CVE-2023-22501` with a CVSS score of 9.4 [1].\n\n# Technical Details\n\nIf the attacker has write access to a User Directory and outgoing email enabled, it can access sign-up tokens sent to users who have never logged into their accounts. Access to the tokens can be obtained either by being included in Jira issues or requests with these users, or by gaining access to emails containing a _View Request_ link. \nAtlassian notes that external customer accounts can be affected in projects where anyone can create their own account, even if the instance is configured with single sign-on.  \n\n# Affected Products\n\nThe vulnerability was introduced in version 5.3.0 and impacts all subsequent versions 5.3.1, 5.3.2, 5.4.0, 5.4.1, and 5.5.0. Atlassian notes that users synced to the Jira service via read-only User Directories or single sign-on (SSO) are not affected. However, external customers who interact with the instance via email are affected, even when SSO is configured. Jira sites hosted on the cloud via an `atlassian[.]net` domain are not affected.\n\n# Recommendations\n\nAtlassian recommends upgrading to the latest fixed versions 5.3.3, 5.5.1, and 5.6.0 or later to remediate this vulnerability. As a temporary workaround, if an upgrade is not immediately possible, a version-specific JAR file can be manually upgraded [1].\n\n\n# References\n\n[1] <https://confluence.atlassian.com/jira/jira-service-management-server-and-data-center-advisory-cve-2023-22501-1188786458.html>",
  "content_html": "<p><em>History:</em></p><ul><li><em>03/02/2023 --- v1.0 -- Initial publication</em></li></ul><h2 id=\"summary\">Summary</h2><p>A critical security flaw has been discovered in Jira Service Management Server and Data Center that can be exploited by an attacker to impersonate another user and gain unauthorized access to instances. The vulnerability is tracked as <code>CVE-2023-22501</code> with a CVSS score of 9.4 [1].</p><h2 id=\"technical-details\">Technical Details</h2><p>If the attacker has write access to a User Directory and outgoing email enabled, it can access sign-up tokens sent to users who have never logged into their accounts. Access to the tokens can be obtained either by being included in Jira issues or requests with these users, or by gaining access to emails containing a <em>View Request</em> link. Atlassian notes that external customer accounts can be affected in projects where anyone can create their own account, even if the instance is configured with single sign-on. </p><h2 id=\"affected-products\">Affected Products</h2><p>The vulnerability was introduced in version 5.3.0 and impacts all subsequent versions 5.3.1, 5.3.2, 5.4.0, 5.4.1, and 5.5.0. Atlassian notes that users synced to the Jira service via read-only User Directories or single sign-on (SSO) are not affected. However, external customers who interact with the instance via email are affected, even when SSO is configured. Jira sites hosted on the cloud via an <code>atlassian[.]net</code> domain are not affected.</p><h2 id=\"recommendations\">Recommendations</h2><p>Atlassian recommends upgrading to the latest fixed versions 5.3.3, 5.5.1, and 5.6.0 or later to remediate this vulnerability. As a temporary workaround, if an upgrade is not immediately possible, a version-specific JAR file can be manually upgraded [1].</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://confluence.atlassian.com/jira/jira-service-management-server-and-data-center-advisory-cve-2023-22501-1188786458.html\">https://confluence.atlassian.com/jira/jira-service-management-server-and-data-center-advisory-cve-2023-22501-1188786458.html</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  },
  "cves": [
    "CVE-2023-22501"
  ]
}