{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2024-114.pdf"
  },
  "title": "Multiple Critical CISCO Vulnerabilities",
  "serial_number": "2024-114",
  "publish_date": "25-10-2024 10:11:37",
  "description": "A set of critical vulnerabilities affecting Cisco Adaptive Security Appliance (ASA) Software, Cisco Firepower Threat Defense (FTD) Software, Cisco Secure Firewall Management Center (FMC) Software, and Cisco Nexus Dashboard Fabric Controller (NDFC) have been identified. These vulnerabilities can potentially allow attackers to conduct various types of attacks, including command injection, remote command execution, arbitrary command execution, and unauthorised access through static credentials due to improper input validation or insecure handling of web services components. Successful exploitation could allow attackers to execute arbitrary commands, gain root-level access through SSH, or gain unauthorised access via static credentials. They obtained CVSS score of 9 out of 10 or more. <br>\n",
  "url_title": "2024-114",
  "content_markdown": "---    \ntitle: 'Multiple Critical CISCO Vulnerabilities'\nnumber: '2024-114'\nversion: '1.0'\noriginal_date: '2024-10-23'\ndate: '2025-10-24'\n---\n\n_History:_\n\n* _25/10/2024 --- v1.0 -- Initial publication_\n\n# Summary\n\nA set of critical vulnerabilities affecting Cisco Adaptive Security Appliance (ASA) Software, Cisco Firepower Threat Defense (FTD) Software, Cisco Secure Firewall Management Center (FMC) Software, and Cisco Nexus Dashboard Fabric Controller (NDFC) have been identified [1-4]. These vulnerabilities can potentially allow attackers to conduct various types of attacks, including command injection, remote command execution, arbitrary command execution, and unauthorised access through static credentials due to improper input validation or insecure handling of web services components. Successful exploitation could allow attackers to execute arbitrary commands, gain root-level access through SSH, or gain unauthorised access via static credentials. They obtained CVSS score of 9 out of 10 or more. \n\n# Technical Details\n\n1. **Command Injection Vulnerability**: A vulnerability in the web-based management interface of Cisco Secure Firewall Management Center (FMC) Software could allow an authenticated, remote attacker to execute arbitrary commands on the underlying operating system as root or to execute commands on managed Cisco Firepower Threat Defense (FTD) devices. This vulnerability is due to insufficient input validation of certain HTTP requests. To exploit this vulnerability, the attacker would need valid credentials for a user account with at least the role of Security Analyst (Read Only) [2].\n\n2. **SSH Remote Command Injection Vulnerability**: A vulnerability in the SSH subsystem of Cisco ASA Software could allow an authenticated, remote attacker to execute operating system commands as root. This vulnerability arises from insufficient validation of user input when executing remote CLI commands over SSH. An attacker with limited user privileges could exploit this vulnerability to gain complete control over the system [4].\n\n3. **Arbitrary Command Execution Vulnerability**: A vulnerability in the REST API and web UI of Cisco Nexus Dashboard Fabric Controller (NDFC) could allow an authenticated, low-privileged, remote attacker to perform a command injection attack. This vulnerability is due to improper user authorisation and insufficient validation of command arguments, allowing attackers to execute arbitrary commands on the CLI of a Cisco NDFC-managed device with network-admin privileges. This vulnerability does not affect Cisco NDFC when configured for storage area network (SAN) controller deployment [3].\n\n4. **Static Credential Vulnerability**: A vulnerability in Cisco Firepower Threat Defense (FTD) Software for Firepower 1000, 2100, 3100, and 4200 Series could allow an unauthenticated, local attacker to access an affected system using static credentials. This vulnerability is due to the presence of static accounts with hard-coded passwords on an affected system. Successful exploitation could allow the attacker to access the affected system, retrieve sensitive information, perform limited troubleshooting actions, modify some configuration options, or render the device unbootable [1].\n\n# Affected Products\n\nThe vulnerabilities affect the following Cisco products:\n\n- Cisco Adaptive Security Appliance (ASA) with CiscoSSH stack enabled and SSH access allowed on a least one interface.\n- Cisco Secure Firewall Management Center (FMC) Software.\n- Cisco Nexus Dashboard Fabric Controller (NDFC).\n- Cisco Firepower Threat Defense (FTD) Software for Firepower 1000, 2100, 3100, and 4200 Series running Cisco FTD Software Release 7.1 through 7.4 with a vulnerability database (VDB) release of 387 or earlier\n\n# Recommendations\n\n- **Upgrade to Fixed Software**: Cisco has released software updates to address these vulnerabilities. Ensure all affected Cisco ASA, FMC, FTD, and NDFC devices are upgraded to a fixed release as described on the customer portal.\n- **Disable CiscoSSH Stack**: For the SSH remote command injection vulnerability and to determine whether the CiscoSSH stack is enabled on a device, use the `show running-config | include ssh` command and verify the presence of the `ssh stack ciscossh` configuration.\n- **Workaround for Static Credential Vulnerability**: Contact Cisco Technical Assistance Center (TAC) to coordinate implementation of the workaround if upgrading to a fixed release is not immediately possible [6]. To determine whether static accounts are present see the detection section of this advisory. \n\n# Detection\n\n## Static Account Vulnerability\n\nTo determine whether static accounts are present, use the `show local-user` command from the security scope in the Cisco FXOS CLI. The following specific accounts are static: \n\n- `csm_processes`\n- `report`\n- `sftop10user`\n- `Sourcefire`\n- `SRU`\n\nTo detect access to the mentioned accounts has occurred, run the following command from expert mode as the root user. If no output is returned, the vulnerable accounts have not been accessed on the device during the retention period of the logs.\n\n`zgrep -E \"Accepted password for (csm_processes|report|sftop10user|Sourcefire|SRU)\" /ngfw/var/log/messages*`\n\n# References\n\n[1] <https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ftd-statcred-dFC8tXT5>\n\n[2] <https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-fmc-cmd-inj-v3AWDqN7>\n\n[3] <https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-asa-ssh-rce-gRAuPEUF>\n\n[4] <https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ndfc-cmdinj-UvYZrKfr>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>25/10/2024 --- v1.0 -- Initial publication</em></li></ul><h2 id=\"summary\">Summary</h2><p>A set of critical vulnerabilities affecting Cisco Adaptive Security Appliance (ASA) Software, Cisco Firepower Threat Defense (FTD) Software, Cisco Secure Firewall Management Center (FMC) Software, and Cisco Nexus Dashboard Fabric Controller (NDFC) have been identified [1-4]. These vulnerabilities can potentially allow attackers to conduct various types of attacks, including command injection, remote command execution, arbitrary command execution, and unauthorised access through static credentials due to improper input validation or insecure handling of web services components. Successful exploitation could allow attackers to execute arbitrary commands, gain root-level access through SSH, or gain unauthorised access via static credentials. They obtained CVSS score of 9 out of 10 or more. </p><h2 id=\"technical-details\">Technical Details</h2><ol><li><p><strong>Command Injection Vulnerability</strong>: A vulnerability in the web-based management interface of Cisco Secure Firewall Management Center (FMC) Software could allow an authenticated, remote attacker to execute arbitrary commands on the underlying operating system as root or to execute commands on managed Cisco Firepower Threat Defense (FTD) devices. This vulnerability is due to insufficient input validation of certain HTTP requests. To exploit this vulnerability, the attacker would need valid credentials for a user account with at least the role of Security Analyst (Read Only) [2].</p></li><li><p><strong>SSH Remote Command Injection Vulnerability</strong>: A vulnerability in the SSH subsystem of Cisco ASA Software could allow an authenticated, remote attacker to execute operating system commands as root. This vulnerability arises from insufficient validation of user input when executing remote CLI commands over SSH. An attacker with limited user privileges could exploit this vulnerability to gain complete control over the system [4].</p></li><li><p><strong>Arbitrary Command Execution Vulnerability</strong>: A vulnerability in the REST API and web UI of Cisco Nexus Dashboard Fabric Controller (NDFC) could allow an authenticated, low-privileged, remote attacker to perform a command injection attack. This vulnerability is due to improper user authorisation and insufficient validation of command arguments, allowing attackers to execute arbitrary commands on the CLI of a Cisco NDFC-managed device with network-admin privileges. This vulnerability does not affect Cisco NDFC when configured for storage area network (SAN) controller deployment [3].</p></li><li><p><strong>Static Credential Vulnerability</strong>: A vulnerability in Cisco Firepower Threat Defense (FTD) Software for Firepower 1000, 2100, 3100, and 4200 Series could allow an unauthenticated, local attacker to access an affected system using static credentials. This vulnerability is due to the presence of static accounts with hard-coded passwords on an affected system. Successful exploitation could allow the attacker to access the affected system, retrieve sensitive information, perform limited troubleshooting actions, modify some configuration options, or render the device unbootable [1].</p></li></ol><h2 id=\"affected-products\">Affected Products</h2><p>The vulnerabilities affect the following Cisco products:</p><ul><li>Cisco Adaptive Security Appliance (ASA) with CiscoSSH stack enabled and SSH access allowed on a least one interface.</li><li>Cisco Secure Firewall Management Center (FMC) Software.</li><li>Cisco Nexus Dashboard Fabric Controller (NDFC).</li><li>Cisco Firepower Threat Defense (FTD) Software for Firepower 1000, 2100, 3100, and 4200 Series running Cisco FTD Software Release 7.1 through 7.4 with a vulnerability database (VDB) release of 387 or earlier</li></ul><h2 id=\"recommendations\">Recommendations</h2><ul><li><strong>Upgrade to Fixed Software</strong>: Cisco has released software updates to address these vulnerabilities. Ensure all affected Cisco ASA, FMC, FTD, and NDFC devices are upgraded to a fixed release as described on the customer portal.</li><li><strong>Disable CiscoSSH Stack</strong>: For the SSH remote command injection vulnerability and to determine whether the CiscoSSH stack is enabled on a device, use the <code>show running-config | include ssh</code> command and verify the presence of the <code>ssh stack ciscossh</code> configuration.</li><li><strong>Workaround for Static Credential Vulnerability</strong>: Contact Cisco Technical Assistance Center (TAC) to coordinate implementation of the workaround if upgrading to a fixed release is not immediately possible [6]. To determine whether static accounts are present see the detection section of this advisory. </li></ul><h2 id=\"detection\">Detection</h2><h3 id=\"static-account-vulnerability\">Static Account Vulnerability</h3><p>To determine whether static accounts are present, use the <code>show local-user</code> command from the security scope in the Cisco FXOS CLI. The following specific accounts are static: </p><ul><li><code>csm_processes</code></li><li><code>report</code></li><li><code>sftop10user</code></li><li><code>Sourcefire</code></li><li><code>SRU</code></li></ul><p>To detect access to the mentioned accounts has occurred, run the following command from expert mode as the root user. If no output is returned, the vulnerable accounts have not been accessed on the device during the retention period of the logs.</p><p><code>zgrep -E \"Accepted password for (csm_processes|report|sftop10user|Sourcefire|SRU)\" /ngfw/var/log/messages*</code></p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ftd-statcred-dFC8tXT5\">https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ftd-statcred-dFC8tXT5</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-fmc-cmd-inj-v3AWDqN7\">https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-fmc-cmd-inj-v3AWDqN7</a></p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-asa-ssh-rce-gRAuPEUF\">https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-asa-ssh-rce-gRAuPEUF</a></p><p>[4] <a rel=\"noopener\" target=\"_blank\" href=\"https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ndfc-cmdinj-UvYZrKfr\">https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-ndfc-cmdinj-UvYZrKfr</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  }
}