{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2017-014.pdf"
  },
  "title": "Petya-Like Malware Campaign",
  "serial_number": "2017-014",
  "publish_date": "28-06-2017 09:34:00",
  "description": "A large malware campaign broke out on Tuesday, 27/06/2017 and was widely reported in the news. The malware used -- which appears to be similar to Petya -- has been augmented with efficient local network spreading mechanisms, which resulted in a very rapid infection rate inside affected organizations. The local propagation is apparently achieved by a combination of the use of EternalBlue (the same exploit as the one used by WannaCry earlier), EternalRomance, and WMIC/psexec propagation vector using credentials harvested with a code similar to Mimikatz. First analysis points to at least one likely infection vector being associated with software update systems for a Ukrainian tax accounting package called MeDoc. However, as among the impacted organizations there were those that did not use the software, it is likely that other infection vectors are also used.",
  "url_title": "2017-014",
  "content_markdown": "---\ntitle: 'Petya-Like Malware Campaign'\nversion: '1.1'\nnumber: '2017-014'\ndate: 'June 29, 2017'\n---\n\n_History:_\n\n* _28/06/2017 --- v1.0: Initial publication_\n* _29/06/2017 --- v1.1: Some corrections and new information about wiping capability_\n\n# Summary\n\nA large malware campaign broke out on Tuesday, 27/06/2017 and was widely reported in the news. The malware used -- which appears to be similar to _Petya_ -- has been augmented with efficient local network spreading mechanisms, which resulted in a very rapid infection rate inside affected organizations. The local propagation is apparently achieved by a combination of the use of _EternalBlue_ (the same exploit as the one used by _WannaCry_ earlier), _EternalRomance_ [8], and WMIC/`psexec` propagation vector using credentials harvested with a code similar to _Mimikatz_ [1, 2].\n\nFirst analysis [3, 4, 8] points to at least one likely infection vector being associated with software update systems for a Ukrainian tax accounting package called _MeDoc_. However, as among the impacted organizations there were those that did not use the software, it is likely that other infection vectors are also used. There are some reports of a watering-hole-type infection vector as well [10].\n\nWhat initially looked like a fairly regular -- although large -- ransomware campaign, the specific targeting of Ukraine and additional disk wiping behavior detected [9, 11], indicate that money extortion was probably not the main objective of the campaign.\n\n# Technical Details\n\n## Infection Vector\n\nMultiple sources [3, 4, 8] point to the infection vector being an infected software update system for a Ukrainian tax accounting package called _MeDoc_. Some details were provided by the Ukrainian Police on Twitter [4] (translated to English):\n\n_This software has a built-in update feature, which periodically accesses the server `http://upd.me-doc.com.ua` with the help of the User Agent `medoc1001189`. The update has a hash:_\n\n`dba9b41462c835a4c52f705e88ea0671f4c72761893ffad79b8348f57e84ba54`\n\n_Most legitimate _pings_ (hits to the server) are approximately 300 bytes. 27/06/2017 at 10:30, program `M.E.doc.` Was updated, which was approximately 333kb. After loading it, the following actions were taken:_\n\n- _a file created: `rundll32.exe`;_\n- _access to local IP addresses on TCP port 139 and TCP port 445;_\n- _create a file: `perfc.bat`;_^[Please note that most sources indicate that the file name is in fact `perfc.dat` -- the Ukrainian Police may have made a typo in their tweet.]\n- _run `cmd.exe` with the following command:_\n\n`/c schtasks /RU \"SYSTEM\" /Create /SC once /TN \"\" /TRCC:\\Windows\\system32_shutdown.exe /r /f \"/ST 14:35\"`\n\n- _another file created: `ac3.tmp` (`02ef73bd2458627ed7b397ec26ee2de2e92c71a0e7588f78734761d8edbdcd9f`) and its subsequent launch._\n\nThese details explain the observations that first infections were reported in Ukraine, and many of the companies affected worldwide had their branches in that country. Infected machines in Ukraine could then use the local network propagation mechanisms to reach across borders. Later, Kaspersky claimed that the malware had been also distributed as a watering-hole attack from `bahmut.com.us/news` [10]. There however no firm technical details related to this information.\n\n## Local Network Propagation\n\nOnce a machine is infected, malware will start attempting to spread in the local network. The malware checks if it runs on a Domain Controller (DC). If yes, than it will only scan the machines that were served IPs using DHCP [2, 8]. If the infected machine is regular one, it appears that the /24 network segment is being scanned by the malware (ports 445 and 139). Once open ports are identified, at least three separate mechanisms are used to infect other machines:\n\n- SMB exploit _EternalBlue_ -- the same one used earlier by _WannaCry_ -- and _EternalRomance_ [8],\n- `psexec` for remote command execution,\n- WMIC (Windows Management Instrumentation Command-Line).\n\n_EternalBlue_ is tried first and since the _modus operandi_ is exactly the same as in case of _WannaCry_, no further details are provided in this advisory. Interested readers should refer to CERT-EU Security Advisory 2017-012. Additionally, also _EternalRomance_ is tried [8]. If the system is patched for these vulnerabilities, the remaining two methods are used.\n\nThe other methods utilized are more original, although based on well-known techniques. First malware uses password dumping tools similar to _Mimikatz_ [1, 2, 3, 8] to harvest credentials on the infected machine. It looks in particular for local administrator credentials. The credentials obtained are then used for remote process execution on other machines in the local network using WMI/`psexec`. The following command is used with `psexec` [3] (where `w.x.y.z` is the target IP address):\n\n\tC:\\WINDOWS\\dllhost.dat \\\\w.x.y.z -accepteula -s -d C:\\Windows\\System32\\rundll32.exe C:\\Windows\\perfc.dat,#1\n\nand the following one using WMI [3] (where `w.x.y.z` is the target IP address, and `username`/`password` are the harvested credentials):\n\n\tWbem\\wmic.exe /node:\"w.x.y.z\" /user:\"username\" /password:\"password\" \"process call create \"C:\\Windows\\System32\\rundll32.exe \\\"C:\\Windows\\perfc.dat\\\" #1\"\n\n## Encryption Process\n\nThe malware tries to obtain administrative privileges (`SeShutdowPrivilege` and `SeDebugPrivilege`) for the current user through the Windows API `AdjustTokenPrivileges`. If successful, the ransomware will overwrite the master boot record (MBR) on the disk drive referred to as `PhysicalDrive 0` within Windows [3].\n\nOnce the malware is installed, it sets a timer for at least 10 min in the future (exact time is random) [8] to reboot the system. It appears that no data is effectively encrypted until the reboot. The malware however clears event logs using the following command [3]:\n\n\twevtutil cl Setup & wevtutil cl System & wevtutil cl Security & wevtutil cl Application & fsutil usn deletejournal /D %c:\n\nOnce rebooted, the malware boots from the modified MBR and shows a fake CHKDSK message [1, 6]. This message is shown during the encryption process -- **if the machine is powered-down immediately, there is still a chance to recover some files before they are encrypted**. However, once a ransom message is shown [7], the files have been effectively encrypted.\n\n_Petya_ uses AES-128 with RSA, and a hardcoded static RSA public key. As there has been only one sample identified so far, all of the infections share the same RSA key. The AES key is randomly generated, used for the encryption, and then encrypted with the RSA key and stored in the `README.TXT` file on disk [12]. The validity of the data in this file has not been however confirmed -- i.e., it is not certain that it is enough to decrypt the data even with access to the RSA private key.\n\nAnother information is than shown as a screen message [13]. This is the information that -- according to the content of the message -- the victim needs to provide to the attackers after paying the ransom to obtain the decryption key. However, it is interesting to notice that the value in the file [12] differs significantly from the value in the note [13]. Furthermore, it has been shown in [9] that the value shown on screen in fact is just **randomly generated** and has **nothing to do with the actual encryption key**.\n\nAdditionally, it has been recently established that the malware performs additional wiping of the first 25 sectors of the disk [11]. While the first sector (MBR) is overwritten to change the boot process (and saved elsewhere) the other 24 sectors are effectively deleted. Together the random value shown in the ransom message, **the attack seems much more to be intentionally destructive and only posing as ransomware**.\n\nFinally, the e-mail account used to send the information about the payments has now been blocked by the provider, so there is not even a way to inform the threat actors about the payment made. All these indicate that not only there is no hope of being able to decrypt the encrypted files, but there was never even the intention to make it possible.\n\n## Kill Switch\n\nSome researchers reported an existence of a **local** _kill switch_ [1, 2]. The kill switch found is in the form of a local file that can be created on the potentially targeted system. The file should be put in `C:\\WINDOWS` directory and should be named the same as the malicious library served, but without an extension. In the observed cases, the name is `perfc`. Once the malware runs, it checks for the presence of this file and stops execution in case it finds it.\n\nThere are however several issues with the way this kill switch works comparing for instance to the kill switch in case of _WannaCry_. While the _WannaCry_ kill switch could have been used randomly, the local kill switch for _Petya_ requires the file to be created _ahead of time_ on _every_ machine that could be potentially targeted. Additionally, the file name needs to be identical to the malicious library being served, which may not always be foreseen. While in observed cases, the name was always the same, it is trivial to change it in the future.\n\n# Products Affected\n\nMajority of the infected systems are running Windows 7. The exact patch level is currently not known. Some articles -- e.g., [8] indicate that Windows 10 was also impacted. There is however no definite list of impacted systems available.\n\n# Recommendations\n\nIf affected -- do not pay ransom. There is currently no way to provide the threat actors with the information needed to generate the decryption key as the e-mail account used for this purpose has been closed, and the information provided by the attackers in the first place seems misleading and unusable [9]. Also, the campaign does not really seem to be focusing on money extortion, but mostly on creating chaos and destruction [9, 11], and hence the threat actors are most likely not interested in providing the decryption keys.\n\nWhile it is potentially possible to use the kill switch to prevent infections, it is not very easy nor practical. Furthermore, based on the analysis of the situation, the most probably scenario for this campaign was that multiple organizations were infected simultaneously (through the MeDoc software update or using other means) and then the infection spread very quickly within these organizations. There do not appear to be new cases reported. Considering the behavior and the design of the malware -- aiming at creating as much chaos and confusion rather than trying to actually extort payments -- and its regional targeting -- it was aimed quite specifically at Ukraine, the risk of new, identical infections is low at the moment.\n\nWhile this campaign does not appear to be aiming at CERT-EU constituents, similarly to previous cases -- once certain methods prove to be efficient and successful, they will most likely be re-used by other threat actors for various purposes. Hence, it is very important to implement measures that would make such attacks ineffective, and in particular:\n\n- patching systems to avoid exploiting known vulnerabilities during the initial infection (e.g., through spear-phishing),\n- ensuring good security policy preventing users from being able to elevate their privileges,\n- preventing machine-to-machine connections in the local network, unless specifically necessary,\n- not re-using the same local administrator passwords throughout many systems.\n\nSome additional specific Microsoft recommendations are discussed also in [8], and specific Snort rules that may help detect/block some activities related to this type of attack have been developed by Talos in [3].\n\n# References\n\n[1] <https://www.malwaretech.com/2017/06/petya-ransomware-attack-whats-known.html>\n\n[2] <https://securingtomorrow.mcafee.com/mcafee-labs/new-variant-petya-ransomware-spreading-like-wildfire/>\n\n[3] <http://blog.talosintelligence.com/2017/06/worldwide-ransomware-variant.html>\n\n[4] <https://twitter.com/CyberpoliceUA/status/879772963658235904>\n\n[5] <https://twitter.com/0xAmit>\n\n[6] <https://zerobin.no/?f4aa14963a899169#79zg8l0TZRNJlm8diIjxAbe9ixRnT+x6NhTFjRh+ie0=>\n\n[7] <https://zerobin.no/?b9c8e4a70311386d#yHG/QlLk3/3A8waWoW+Bws/1lVsBoBrxI8LzXbT1HaA=>\n\n[8] <https://blogs.technet.microsoft.com/mmpc/2017/06/27/new-ransomware-old-techniques-petya-adds-worm-capabilities/>\n\n[9] <https://securelist.com/expetrpetyanotpetya-is-a-wiper-not-ransomware/78902/>\n\n[10] <https://twitter.com/craiu/status/880011103161524224>\n\n[11] <https://blog.comae.io/petya-2017-is-a-wiper-not-a-ransomware-9ea1d8961d3b>\n\n[12] <https://msdnshared.blob.core.windows.net/media/2017/06/petya-readme.png>\n\n[13] <https://msdnshared.blob.core.windows.net/media/2017/06/petya-ransom-note.png>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>28/06/2017 --- v1.0: Initial publication</em></li><li><em>29/06/2017 --- v1.1: Some corrections and new information about wiping capability</em></li></ul><h2 id=\"summary\">Summary</h2><p>A large malware campaign broke out on Tuesday, 27/06/2017 and was widely reported in the news. The malware used -- which appears to be similar to <em>Petya</em> -- has been augmented with efficient local network spreading mechanisms, which resulted in a very rapid infection rate inside affected organizations. The local propagation is apparently achieved by a combination of the use of <em>EternalBlue</em> (the same exploit as the one used by <em>WannaCry</em> earlier), <em>EternalRomance</em> [8], and WMIC/<code>psexec</code> propagation vector using credentials harvested with a code similar to <em>Mimikatz</em> [1, 2].</p><p>First analysis [3, 4, 8] points to at least one likely infection vector being associated with software update systems for a Ukrainian tax accounting package called <em>MeDoc</em>. However, as among the impacted organizations there were those that did not use the software, it is likely that other infection vectors are also used. There are some reports of a watering-hole-type infection vector as well [10].</p><p>What initially looked like a fairly regular -- although large -- ransomware campaign, the specific targeting of Ukraine and additional disk wiping behavior detected [9, 11], indicate that money extortion was probably not the main objective of the campaign.</p><h2 id=\"technical-details\">Technical Details</h2><h3 id=\"infection-vector\">Infection Vector</h3><p>Multiple sources [3, 4, 8] point to the infection vector being an infected software update system for a Ukrainian tax accounting package called <em>MeDoc</em>. Some details were provided by the Ukrainian Police on Twitter [4] (translated to English):</p><p><em>This software has a built-in update feature, which periodically accesses the server <code>http://upd.me-doc.com.ua</code> with the help of the User Agent <code>medoc1001189</code>. The update has a hash:</em></p><p><code>dba9b41462c835a4c52f705e88ea0671f4c72761893ffad79b8348f57e84ba54</code></p><p><em>Most legitimate _pings</em> (hits to the server) are approximately 300 bytes. 27/06/2017 at 10:30, program <code>M.E.doc.</code> Was updated, which was approximately 333kb. After loading it, the following actions were taken:_</p><ul><li><em>a file created: <code>rundll32.exe</code>;</em></li><li><em>access to local IP addresses on TCP port 139 and TCP port 445;</em></li><li><em>create a file: <code>perfc.bat</code>;</em>^[Please note that most sources indicate that the file name is in fact <code>perfc.dat</code> -- the Ukrainian Police may have made a typo in their tweet.]</li><li><em>run <code>cmd.exe</code> with the following command:</em></li></ul><p><code>/c schtasks /RU \"SYSTEM\" /Create /SC once /TN \"\" /TRCC:\\Windows\\system32_shutdown.exe /r /f \"/ST 14:35\"</code></p><ul><li><em>another file created: <code>ac3.tmp</code> (<code>02ef73bd2458627ed7b397ec26ee2de2e92c71a0e7588f78734761d8edbdcd9f</code>) and its subsequent launch.</em></li></ul><p>These details explain the observations that first infections were reported in Ukraine, and many of the companies affected worldwide had their branches in that country. Infected machines in Ukraine could then use the local network propagation mechanisms to reach across borders. Later, Kaspersky claimed that the malware had been also distributed as a watering-hole attack from <code>bahmut.com.us/news</code> [10]. There however no firm technical details related to this information.</p><h3 id=\"local-network-propagation\">Local Network Propagation</h3><p>Once a machine is infected, malware will start attempting to spread in the local network. The malware checks if it runs on a Domain Controller (DC). If yes, than it will only scan the machines that were served IPs using DHCP [2, 8]. If the infected machine is regular one, it appears that the /24 network segment is being scanned by the malware (ports 445 and 139). Once open ports are identified, at least three separate mechanisms are used to infect other machines:</p><ul><li>SMB exploit <em>EternalBlue</em> -- the same one used earlier by <em>WannaCry</em> -- and <em>EternalRomance</em> [8],</li><li><code>psexec</code> for remote command execution,</li><li>WMIC (Windows Management Instrumentation Command-Line).</li></ul><p><em>EternalBlue</em> is tried first and since the <em>modus operandi</em> is exactly the same as in case of <em>WannaCry</em>, no further details are provided in this advisory. Interested readers should refer to CERT-EU Security Advisory 2017-012. Additionally, also <em>EternalRomance</em> is tried [8]. If the system is patched for these vulnerabilities, the remaining two methods are used.</p><p>The other methods utilized are more original, although based on well-known techniques. First malware uses password dumping tools similar to <em>Mimikatz</em> [1, 2, 3, 8] to harvest credentials on the infected machine. It looks in particular for local administrator credentials. The credentials obtained are then used for remote process execution on other machines in the local network using WMI/<code>psexec</code>. The following command is used with <code>psexec</code> [3] (where <code>w.x.y.z</code> is the target IP address):</p><pre><code>C:\\WINDOWS\\dllhost.dat \\\\w.x.y.z -accepteula -s -d C:\\Windows\\System32\\rundll32.exe C:\\Windows\\perfc.dat,#1\n</code></pre><p>and the following one using WMI [3] (where <code>w.x.y.z</code> is the target IP address, and <code>username</code>/<code>password</code> are the harvested credentials):</p><pre><code>Wbem\\wmic.exe /node:\"w.x.y.z\" /user:\"username\" /password:\"password\" \"process call create \"C:\\Windows\\System32\\rundll32.exe \\\"C:\\Windows\\perfc.dat\\\" #1\"\n</code></pre><h3 id=\"encryption-process\">Encryption Process</h3><p>The malware tries to obtain administrative privileges (<code>SeShutdowPrivilege</code> and <code>SeDebugPrivilege</code>) for the current user through the Windows API <code>AdjustTokenPrivileges</code>. If successful, the ransomware will overwrite the master boot record (MBR) on the disk drive referred to as <code>PhysicalDrive 0</code> within Windows [3].</p><p>Once the malware is installed, it sets a timer for at least 10 min in the future (exact time is random) [8] to reboot the system. It appears that no data is effectively encrypted until the reboot. The malware however clears event logs using the following command [3]:</p><pre><code>wevtutil cl Setup &amp; wevtutil cl System &amp; wevtutil cl Security &amp; wevtutil cl Application &amp; fsutil usn deletejournal /D %c:\n</code></pre><p>Once rebooted, the malware boots from the modified MBR and shows a fake CHKDSK message [1, 6]. This message is shown during the encryption process -- <strong>if the machine is powered-down immediately, there is still a chance to recover some files before they are encrypted</strong>. However, once a ransom message is shown [7], the files have been effectively encrypted.</p><p><em>Petya</em> uses AES-128 with RSA, and a hardcoded static RSA public key. As there has been only one sample identified so far, all of the infections share the same RSA key. The AES key is randomly generated, used for the encryption, and then encrypted with the RSA key and stored in the <code>README.TXT</code> file on disk [12]. The validity of the data in this file has not been however confirmed -- i.e., it is not certain that it is enough to decrypt the data even with access to the RSA private key.</p><p>Another information is than shown as a screen message [13]. This is the information that -- according to the content of the message -- the victim needs to provide to the attackers after paying the ransom to obtain the decryption key. However, it is interesting to notice that the value in the file [12] differs significantly from the value in the note [13]. Furthermore, it has been shown in [9] that the value shown on screen in fact is just <strong>randomly generated</strong> and has <strong>nothing to do with the actual encryption key</strong>.</p><p>Additionally, it has been recently established that the malware performs additional wiping of the first 25 sectors of the disk [11]. While the first sector (MBR) is overwritten to change the boot process (and saved elsewhere) the other 24 sectors are effectively deleted. Together the random value shown in the ransom message, <strong>the attack seems much more to be intentionally destructive and only posing as ransomware</strong>.</p><p>Finally, the e-mail account used to send the information about the payments has now been blocked by the provider, so there is not even a way to inform the threat actors about the payment made. All these indicate that not only there is no hope of being able to decrypt the encrypted files, but there was never even the intention to make it possible.</p><h3 id=\"kill-switch\">Kill Switch</h3><p>Some researchers reported an existence of a <strong>local</strong> <em>kill switch</em> [1, 2]. The kill switch found is in the form of a local file that can be created on the potentially targeted system. The file should be put in <code>C:\\WINDOWS</code> directory and should be named the same as the malicious library served, but without an extension. In the observed cases, the name is <code>perfc</code>. Once the malware runs, it checks for the presence of this file and stops execution in case it finds it.</p><p>There are however several issues with the way this kill switch works comparing for instance to the kill switch in case of <em>WannaCry</em>. While the <em>WannaCry</em> kill switch could have been used randomly, the local kill switch for <em>Petya</em> requires the file to be created <em>ahead of time</em> on <em>every</em> machine that could be potentially targeted. Additionally, the file name needs to be identical to the malicious library being served, which may not always be foreseen. While in observed cases, the name was always the same, it is trivial to change it in the future.</p><h2 id=\"products-affected\">Products Affected</h2><p>Majority of the infected systems are running Windows 7. The exact patch level is currently not known. Some articles -- e.g., [8] indicate that Windows 10 was also impacted. There is however no definite list of impacted systems available.</p><h2 id=\"recommendations\">Recommendations</h2><p>If affected -- do not pay ransom. There is currently no way to provide the threat actors with the information needed to generate the decryption key as the e-mail account used for this purpose has been closed, and the information provided by the attackers in the first place seems misleading and unusable [9]. Also, the campaign does not really seem to be focusing on money extortion, but mostly on creating chaos and destruction [9, 11], and hence the threat actors are most likely not interested in providing the decryption keys.</p><p>While it is potentially possible to use the kill switch to prevent infections, it is not very easy nor practical. Furthermore, based on the analysis of the situation, the most probably scenario for this campaign was that multiple organizations were infected simultaneously (through the MeDoc software update or using other means) and then the infection spread very quickly within these organizations. There do not appear to be new cases reported. Considering the behavior and the design of the malware -- aiming at creating as much chaos and confusion rather than trying to actually extort payments -- and its regional targeting -- it was aimed quite specifically at Ukraine, the risk of new, identical infections is low at the moment.</p><p>While this campaign does not appear to be aiming at CERT-EU constituents, similarly to previous cases -- once certain methods prove to be efficient and successful, they will most likely be re-used by other threat actors for various purposes. Hence, it is very important to implement measures that would make such attacks ineffective, and in particular:</p><ul><li>patching systems to avoid exploiting known vulnerabilities during the initial infection (e.g., through spear-phishing),</li><li>ensuring good security policy preventing users from being able to elevate their privileges,</li><li>preventing machine-to-machine connections in the local network, unless specifically necessary,</li><li>not re-using the same local administrator passwords throughout many systems.</li></ul><p>Some additional specific Microsoft recommendations are discussed also in [8], and specific Snort rules that may help detect/block some activities related to this type of attack have been developed by Talos in [3].</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.malwaretech.com/2017/06/petya-ransomware-attack-whats-known.html\">https://www.malwaretech.com/2017/06/petya-ransomware-attack-whats-known.html</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://securingtomorrow.mcafee.com/mcafee-labs/new-variant-petya-ransomware-spreading-like-wildfire/\">https://securingtomorrow.mcafee.com/mcafee-labs/new-variant-petya-ransomware-spreading-like-wildfire/</a></p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"http://blog.talosintelligence.com/2017/06/worldwide-ransomware-variant.html\">http://blog.talosintelligence.com/2017/06/worldwide-ransomware-variant.html</a></p><p>[4] <a rel=\"noopener\" target=\"_blank\" href=\"https://twitter.com/CyberpoliceUA/status/879772963658235904\">https://twitter.com/CyberpoliceUA/status/879772963658235904</a></p><p>[5] <a rel=\"noopener\" target=\"_blank\" href=\"https://twitter.com/0xAmit\">https://twitter.com/0xAmit</a></p><p>[6] <a rel=\"noopener\" target=\"_blank\" href=\"https://zerobin.no/?f4aa14963a899169#79zg8l0TZRNJlm8diIjxAbe9ixRnT+x6NhTFjRh+ie0=\">https://zerobin.no/?f4aa14963a899169#79zg8l0TZRNJlm8diIjxAbe9ixRnT+x6NhTFjRh+ie0=</a></p><p>[7] <a rel=\"noopener\" target=\"_blank\" href=\"https://zerobin.no/?b9c8e4a70311386d#yHG/QlLk3/3A8waWoW+Bws/1lVsBoBrxI8LzXbT1HaA=\">https://zerobin.no/?b9c8e4a70311386d#yHG/QlLk3/3A8waWoW+Bws/1lVsBoBrxI8LzXbT1HaA=</a></p><p>[8] <a rel=\"noopener\" target=\"_blank\" href=\"https://blogs.technet.microsoft.com/mmpc/2017/06/27/new-ransomware-old-techniques-petya-adds-worm-capabilities/\">https://blogs.technet.microsoft.com/mmpc/2017/06/27/new-ransomware-old-techniques-petya-adds-worm-capabilities/</a></p><p>[9] <a rel=\"noopener\" target=\"_blank\" href=\"https://securelist.com/expetrpetyanotpetya-is-a-wiper-not-ransomware/78902/\">https://securelist.com/expetrpetyanotpetya-is-a-wiper-not-ransomware/78902/</a></p><p>[10] <a rel=\"noopener\" target=\"_blank\" href=\"https://twitter.com/craiu/status/880011103161524224\">https://twitter.com/craiu/status/880011103161524224</a></p><p>[11] <a rel=\"noopener\" target=\"_blank\" href=\"https://blog.comae.io/petya-2017-is-a-wiper-not-a-ransomware-9ea1d8961d3b\">https://blog.comae.io/petya-2017-is-a-wiper-not-a-ransomware-9ea1d8961d3b</a></p><p>[12] <a rel=\"noopener\" target=\"_blank\" href=\"https://msdnshared.blob.core.windows.net/media/2017/06/petya-readme.png\">https://msdnshared.blob.core.windows.net/media/2017/06/petya-readme.png</a></p><p>[13] <a rel=\"noopener\" target=\"_blank\" href=\"https://msdnshared.blob.core.windows.net/media/2017/06/petya-ransom-note.png\">https://msdnshared.blob.core.windows.net/media/2017/06/petya-ransom-note.png</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  },
  "cves": []
}