{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2017-015.pdf"
  },
  "title": "Cisco SNMP Remote Code Execution Vulnerabilities",
  "serial_number": "2017-015",
  "publish_date": "30-06-2017 12:32:00",
  "description": "The Simple Network Management Protocol (SNMP) subsystem of Cisco IOS and IOS XE Software contains multiple vulnerabilities that could allow an authenticated, attacker to remotely execute code on an affected system or cause an affected system to reload. An attacker could exploit these vulnerabilities by sending a crafted SNMP packet to an affected system via IPv4 or IPv6.",
  "url_title": "2017-015",
  "content_markdown": "---\ntitle: 'Cisco SNMP Remote Code Execution Vulnerabilities'\nversion: '1.0'\nnumber: '2017-015'\ndate: 'June 30, 2017'\n---\n\n_History:_\n\n* _30/06/2017 --- v1.0: Initial publication_\n\n# Summary\n\nThe Simple Network Management Protocol (SNMP) subsystem of Cisco IOS and IOS XE Software contains multiple vulnerabilities that could allow **an authenticated**, attacker to **remotely execute code** on an affected system or cause an affected system to reload [1]. An attacker could exploit these vulnerabilities by sending a crafted SNMP packet to an affected system via IPv4 or IPv6.\n\nThere are currently no patches available to fix this vulnerability, but Cisco is planning to release them [1]. Workarounds allowing to mitigate the risk are available.\n\n# Technical Details\n\nThe vulnerabilities are due to a buffer overflow condition in the SNMP subsystem of the affected software. The vulnerabilities affect all versions of SNMP - Versions 1, 2c, and 3. To exploit these vulnerabilities via **SNMP Version 2c or earlier**, the attacker must know the SNMP **read-only community string** for the affected system. To exploit these vulnerabilities via **SNMP Version 3**, the attacker must have **user credentials** for the affected system.\n\nA successful exploit could allow the attacker to **execute arbitrary code** and obtain full control of the affected system or cause the affected system to reload. Exploitation of these vulnerabilities will cause an affected device to reload and generate a `crashinfo` file. In case this file is found, contact the Cisco Technical Assistance Center (TAC) to review the file and determine whether the device has been compromised by exploitation of these vulnerabilities.\n\nCisco is aware of external knowledge of these vulnerabilities, so there is the potential for exploitation [1].\n\n# Products Affected\n\nThese vulnerabilities affect all releases of Cisco IOS and IOS XE Software prior to the first fixed release, and they affect all versions of SNMP—Versions 1, 2c, and 3.\n\nDevices configured with any of the following MIBs are vulnerable:\n\n\tADSL-LINE-MIB\n\tALPS-MIB\n\tCISCO-ADSL-DMT-LINE-MIB\n\tCISCO-BSTUN-MIB\n\tCISCO-MAC-AUTH-BYPASS-MIB\n\tCISCO-SLB-EXT-MIB\n\tCISCO-VOICE-DNIS-MIB\n\tCISCO-VOICE-NUMBER-EXPANSION-MIB\n\tTN3270E-RT-MIB\n\nAlthough the `show snmp mib` command can be used to display a list of the MIB OIDs that are registered on a system, use of a network management system (NMS) application is the recommended solution for gathering this information [1].\n\n# Recommendations\n\nNo fixes are available at this time. When fixes will become available, they will be available as new software versions for the customers who have valid license, through the regular update channels [1].\n\n## Workarounds\n\nAdministrators are advised to allow only trusted users to have SNMP access on an affected system. Administrators are also advised to monitor affected systems by using the `show snmp host` command in the CLI. In addition, administrators can mitigate these vulnerabilities by disabling the MIBs listed in the previous section [1].\n\nTo help customers determine their exposure to vulnerabilities in Cisco IOS and IOS XE Software, Cisco provides a tool, the Cisco IOS Software Checker [2] that identifies any Cisco Security Advisories that impact a specific software release and the earliest release that fixes the vulnerabilities described in each advisory (_First Fixed_). If applicable, the tool also returns the earliest release that fixes all the vulnerabilities described in all the advisories identified (_Combined First Fixed_).\n\n# References\n\n[1] <https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170629-snmp>\n\n[2] <https://tools.cisco.com/security/center/selectIOSVersion.x>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>30/06/2017 --- v1.0: Initial publication</em></li></ul><h2 id=\"summary\">Summary</h2><p>The Simple Network Management Protocol (SNMP) subsystem of Cisco IOS and IOS XE Software contains multiple vulnerabilities that could allow <strong>an authenticated</strong>, attacker to <strong>remotely execute code</strong> on an affected system or cause an affected system to reload [1]. An attacker could exploit these vulnerabilities by sending a crafted SNMP packet to an affected system via IPv4 or IPv6.</p><p>There are currently no patches available to fix this vulnerability, but Cisco is planning to release them [1]. Workarounds allowing to mitigate the risk are available.</p><h2 id=\"technical-details\">Technical Details</h2><p>The vulnerabilities are due to a buffer overflow condition in the SNMP subsystem of the affected software. The vulnerabilities affect all versions of SNMP - Versions 1, 2c, and 3. To exploit these vulnerabilities via <strong>SNMP Version 2c or earlier</strong>, the attacker must know the SNMP <strong>read-only community string</strong> for the affected system. To exploit these vulnerabilities via <strong>SNMP Version 3</strong>, the attacker must have <strong>user credentials</strong> for the affected system.</p><p>A successful exploit could allow the attacker to <strong>execute arbitrary code</strong> and obtain full control of the affected system or cause the affected system to reload. Exploitation of these vulnerabilities will cause an affected device to reload and generate a <code>crashinfo</code> file. In case this file is found, contact the Cisco Technical Assistance Center (TAC) to review the file and determine whether the device has been compromised by exploitation of these vulnerabilities.</p><p>Cisco is aware of external knowledge of these vulnerabilities, so there is the potential for exploitation [1].</p><h2 id=\"products-affected\">Products Affected</h2><p>These vulnerabilities affect all releases of Cisco IOS and IOS XE Software prior to the first fixed release, and they affect all versions of SNMP—Versions 1, 2c, and 3.</p><p>Devices configured with any of the following MIBs are vulnerable:</p><pre><code>ADSL-LINE-MIB\nALPS-MIB\nCISCO-ADSL-DMT-LINE-MIB\nCISCO-BSTUN-MIB\nCISCO-MAC-AUTH-BYPASS-MIB\nCISCO-SLB-EXT-MIB\nCISCO-VOICE-DNIS-MIB\nCISCO-VOICE-NUMBER-EXPANSION-MIB\nTN3270E-RT-MIB\n</code></pre><p>Although the <code>show snmp mib</code> command can be used to display a list of the MIB OIDs that are registered on a system, use of a network management system (NMS) application is the recommended solution for gathering this information [1].</p><h2 id=\"recommendations\">Recommendations</h2><p>No fixes are available at this time. When fixes will become available, they will be available as new software versions for the customers who have valid license, through the regular update channels [1].</p><h3 id=\"workarounds\">Workarounds</h3><p>Administrators are advised to allow only trusted users to have SNMP access on an affected system. Administrators are also advised to monitor affected systems by using the <code>show snmp host</code> command in the CLI. In addition, administrators can mitigate these vulnerabilities by disabling the MIBs listed in the previous section [1].</p><p>To help customers determine their exposure to vulnerabilities in Cisco IOS and IOS XE Software, Cisco provides a tool, the Cisco IOS Software Checker [2] that identifies any Cisco Security Advisories that impact a specific software release and the earliest release that fixes the vulnerabilities described in each advisory (<em>First Fixed</em>). If applicable, the tool also returns the earliest release that fixes all the vulnerabilities described in all the advisories identified (<em>Combined First Fixed</em>).</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170629-snmp\">https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20170629-snmp</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://tools.cisco.com/security/center/selectIOSVersion.x\">https://tools.cisco.com/security/center/selectIOSVersion.x</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  },
  "cves": []
}