{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2021-043.pdf"
  },
  "title": "Multiple Vulnerabilities in Cisco Products",
  "serial_number": "2021-043",
  "publish_date": "05-08-2021 12:44:00",
  "description": "On August 4, Cisco released multiple security updates to address several security vulnerabilities. This list includes critical and high-severity vulnerabilities affecting Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers and high-severity vulnerabilities affecting:<br><br>- Cisco Small Business RV160 and RV260 Series VPN Routers.<br><br>- Cisco Network Services Orchestrator CLI Secure Shell Server.<br><br>- ConfD CLI Secure Shell Server.<br><br>The vulnerabilities in the web-based management interface of the Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers could allow an attacker to execute arbitrary code, cause a denial of service (DoS) condition and execute arbitrary commands. Moreover, a vulnerability in Cisco Small Business RV160, RV160W, RV260, RV260P, and RV260W VPN Routers could allow an unauthenticated, remote attacker to execute arbitrary commands on the underlying operating system of an affected device.<br><br>The vulnerability affecting both Cisco Network Services Orchestrator CLI Secure Shell Server and ConfD CLI Secure Shell Server could allow an authenticated, local attacker to execute arbitrary commands.",
  "url_title": "2021-043",
  "content_markdown": "---\ntitle: 'Multiple Vulnerabilities in Cisco Products'\nversion: '1.0'\nnumber: '2021-043'\ndate: 'August 5, 2021'\n---\n\n_History:_\n\n* _05/08/2021 --- v1.0 -- Initial publication_\n\n# Summary\n\nOn August 4, Cisco released multiple security updates to address several security vulnerabilities [1]. This list includes critical and high-severity vulnerabilities affecting Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers and high-severity vulnerabilities affecting:\n\n- Cisco Small Business RV160 and RV260 Series VPN Routers.\n- Cisco Network Services Orchestrator CLI Secure Shell Server.\n- ConfD CLI Secure Shell Server.\n\nThe vulnerabilities in the web-based management interface of the Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers could allow an attacker to execute arbitrary code, cause a denial of service (DoS) condition and execute arbitrary commands [2]. Moreover, a vulnerability in Cisco Small Business RV160, RV160W, RV260, RV260P, and RV260W VPN Routers could allow an unauthenticated, remote attacker to execute arbitrary commands on the underlying operating system of an affected device [3]. \n\nThe vulnerability affecting both Cisco Network Services Orchestrator CLI Secure Shell Server and ConfD CLI Secure Shell Server could allow an authenticated, local attacker to execute arbitrary commands [4, 5].\n\n# Technical details\n\n## CVE-2021-1609 - Remote Code Execution and Denial of Service Vulnerability\n\nThis critical vulnerability (CVSS score: 9.8 [2]) exists because HTTP requests are not properly validated. An attacker could exploit this vulnerability by sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to remotely execute arbitrary code on the device or cause the device to reload, resulting in a DoS condition [2].\n\n## CVE-2021-1610 - Command Injection Vulnerability\n\nThis high-severity vulnerability (CVSS score: 7.2 [2]) in the web-based management interface of Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers could allow an authenticated, remote attacker to execute arbitrary commands with root privileges on an affected device. This vulnerability exists because HTTP requests are not properly validated. An attacker could exploit this vulnerability by sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to execute arbitrary commands as _root_ on the underlying operating system [2].\n\n## CVE-2021-1602 - Remote Command Execution Vulnerability\n\nThis high-severity vulnerability (CVSS score: 8.2 [3]) in the web-based management interface of Cisco Small Business RV160, RV160W, RV260, RV260P, and RV260W VPN Routers could allow an unauthenticated, remote attacker to execute arbitrary commands on the underlying operating system of an affected device.\nThis vulnerability is due to insufficient user input validation. An attacker could exploit this vulnerability by sending a crafted request to the web-based management interface. A successful exploit could allow the attacker to execute arbitrary commands on an affected device using root-level privileges. Due to the nature of the vulnerability, only commands without parameters can be executed [3].\n\n## CVE-2021-1572 - Privilege Escalation Vulnerability\n\nThis high severity vulnerability (CVSS score: 7.8 [4,5]) affects both Cisco Network Services Orchestrator (NSO) and ConfD CLI Secure Shell Server.\n\nA vulnerability in Cisco Network Services Orchestrator (NSO) could allow an authenticated, local attacker to execute arbitrary commands at the level of the account under which Cisco NSO is running, which is _root_ by default. To exploit this vulnerability, an attacker must have a valid account on an affected device. The vulnerability exists because the affected software incorrectly runs the SFTP user service at the privilege level of the account that was running when the NSO built-in Secure Shell (SSH) server for CLI was enabled. If the NSO built-in SSH server was not enabled, the device is not affected by this vulnerability. An attacker with low-level privileges could exploit this vulnerability by authenticating to an affected device and issuing a series of commands at the SFTP interface. A successful exploit could allow the attacker to elevate privileges to the level of the account under which Cisco NSO is running, which is _root_ by default. Any user who can authenticate to the built-in SSH server may exploit this vulnerability. By default, all Cisco NSO users have this access if the server is enabled [4].\n\nA vulnerability in ConfD could allow an authenticated, local attacker to execute arbitrary commands at the level of the account under which ConfD is running, which is commonly _root_. To exploit this vulnerability, an attacker must have a valid account on an affected device. The vulnerability exists because the affected software incorrectly runs the SFTP user service at the privilege level of the account that was running when the ConfD built-in Secure Shell (SSH) server for CLI was enabled. If the ConfD built-in SSH server was not enabled, the device is not affected by this vulnerability. An attacker with low-level privileges could exploit this vulnerability by authenticating to an affected device and issuing a series of commands at the SFTP interface. A successful exploit could allow the attacker to elevate privileges to the level of the account under which ConfD is running, which is commonly _root_[5].\n\n# Products affected\n\nCVE-2021-1574 and CVE-2021-1576 vulnerabilities affect the following Cisco Small Business Routers if they are running a firmware release earlier than Release 1.0.03.22:\n\n- RV340 Dual WAN Gigabit VPN Router\n- RV340W Dual WAN Gigabit Wireless-AC VPN Router\n- RV345 Dual WAN Gigabit VPN Router\n- RV345P Dual WAN Gigabit POE VPN Router\n\nCVE-2021-1602 vulnerability affects the following Cisco Small Business RV Series Routers if they are running firmware releases earlier than 1.0.01.04:\n\n- RV160 VPN Routers\n- RV160W Wireless-AC VPN Routers\n- RV260 VPN Routers\n- RV260P VPN Router with PoE\n- RV260W Wireless-AC VPN Routers\n\nCVE-2021-1572 vulnerability affects the following Cisco products and releases:\n\n|Cisco Network Services Orchestrator CLI Secure Shell Server | ConfD CLI Secure Shell Server|\n|--- | ---|\n|Releases 5.4 through 5.4.3.1 | Releases 7.4 through 7.4.3|\n|Releases 5.5 through 5.5.2.2 | Releases 7.5 through 7.5.2|\n\n# Recommendations\n\nCisco has released software updates addressing these vulnerabilities [1, 2, 3, 4, 5].\n\nThere is no workaround addressing these vulnerabilities. However, mitigation steps are available for the vulnerability CVE-2021-1602 affecting Cisco NSO and ConfD CLI [4, 5].\n\nCERT-EU recommends updating vulnerable applications as soon as possible.\n\n# References\n\n[1] <https://tools.cisco.com/security/center/publicationListing.x>\n\n[2] <https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-rv340-cmdinj-rcedos-pY8J3qfy>\n\n[3] <https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-rv-code-execution-9UVJr7k4>\n\n[4] <https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-nso-priv-esc-XXqRtTfT>\n\n[5] <https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-confd-priv-esc-LsGtCRx4>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>05/08/2021 --- v1.0 -- Initial publication</em></li></ul><h2 id=\"summary\">Summary</h2><p>On August 4, Cisco released multiple security updates to address several security vulnerabilities [1]. This list includes critical and high-severity vulnerabilities affecting Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers and high-severity vulnerabilities affecting:</p><ul><li>Cisco Small Business RV160 and RV260 Series VPN Routers.</li><li>Cisco Network Services Orchestrator CLI Secure Shell Server.</li><li>ConfD CLI Secure Shell Server.</li></ul><p>The vulnerabilities in the web-based management interface of the Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers could allow an attacker to execute arbitrary code, cause a denial of service (DoS) condition and execute arbitrary commands [2]. Moreover, a vulnerability in Cisco Small Business RV160, RV160W, RV260, RV260P, and RV260W VPN Routers could allow an unauthenticated, remote attacker to execute arbitrary commands on the underlying operating system of an affected device [3]. </p><p>The vulnerability affecting both Cisco Network Services Orchestrator CLI Secure Shell Server and ConfD CLI Secure Shell Server could allow an authenticated, local attacker to execute arbitrary commands [4, 5].</p><h2 id=\"technical-details\">Technical details</h2><h3 id=\"cve-2021-1609-remote-code-execution-and-denial-of-service-vulnerability\">CVE-2021-1609 - Remote Code Execution and Denial of Service Vulnerability</h3><p>This critical vulnerability (CVSS score: 9.8 [2]) exists because HTTP requests are not properly validated. An attacker could exploit this vulnerability by sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to remotely execute arbitrary code on the device or cause the device to reload, resulting in a DoS condition [2].</p><h3 id=\"cve-2021-1610-command-injection-vulnerability\">CVE-2021-1610 - Command Injection Vulnerability</h3><p>This high-severity vulnerability (CVSS score: 7.2 [2]) in the web-based management interface of Cisco Small Business RV340, RV340W, RV345, and RV345P Dual WAN Gigabit VPN Routers could allow an authenticated, remote attacker to execute arbitrary commands with root privileges on an affected device. This vulnerability exists because HTTP requests are not properly validated. An attacker could exploit this vulnerability by sending a crafted HTTP request to an affected device. A successful exploit could allow the attacker to execute arbitrary commands as <em>root</em> on the underlying operating system [2].</p><h3 id=\"cve-2021-1602-remote-command-execution-vulnerability\">CVE-2021-1602 - Remote Command Execution Vulnerability</h3><p>This high-severity vulnerability (CVSS score: 8.2 [3]) in the web-based management interface of Cisco Small Business RV160, RV160W, RV260, RV260P, and RV260W VPN Routers could allow an unauthenticated, remote attacker to execute arbitrary commands on the underlying operating system of an affected device. This vulnerability is due to insufficient user input validation. An attacker could exploit this vulnerability by sending a crafted request to the web-based management interface. A successful exploit could allow the attacker to execute arbitrary commands on an affected device using root-level privileges. Due to the nature of the vulnerability, only commands without parameters can be executed [3].</p><h3 id=\"cve-2021-1572-privilege-escalation-vulnerability\">CVE-2021-1572 - Privilege Escalation Vulnerability</h3><p>This high severity vulnerability (CVSS score: 7.8 [4,5]) affects both Cisco Network Services Orchestrator (NSO) and ConfD CLI Secure Shell Server.</p><p>A vulnerability in Cisco Network Services Orchestrator (NSO) could allow an authenticated, local attacker to execute arbitrary commands at the level of the account under which Cisco NSO is running, which is <em>root</em> by default. To exploit this vulnerability, an attacker must have a valid account on an affected device. The vulnerability exists because the affected software incorrectly runs the SFTP user service at the privilege level of the account that was running when the NSO built-in Secure Shell (SSH) server for CLI was enabled. If the NSO built-in SSH server was not enabled, the device is not affected by this vulnerability. An attacker with low-level privileges could exploit this vulnerability by authenticating to an affected device and issuing a series of commands at the SFTP interface. A successful exploit could allow the attacker to elevate privileges to the level of the account under which Cisco NSO is running, which is <em>root</em> by default. Any user who can authenticate to the built-in SSH server may exploit this vulnerability. By default, all Cisco NSO users have this access if the server is enabled [4].</p><p>A vulnerability in ConfD could allow an authenticated, local attacker to execute arbitrary commands at the level of the account under which ConfD is running, which is commonly <em>root</em>. To exploit this vulnerability, an attacker must have a valid account on an affected device. The vulnerability exists because the affected software incorrectly runs the SFTP user service at the privilege level of the account that was running when the ConfD built-in Secure Shell (SSH) server for CLI was enabled. If the ConfD built-in SSH server was not enabled, the device is not affected by this vulnerability. An attacker with low-level privileges could exploit this vulnerability by authenticating to an affected device and issuing a series of commands at the SFTP interface. A successful exploit could allow the attacker to elevate privileges to the level of the account under which ConfD is running, which is commonly <em>root</em>[5].</p><h2 id=\"products-affected\">Products affected</h2><p>CVE-2021-1574 and CVE-2021-1576 vulnerabilities affect the following Cisco Small Business Routers if they are running a firmware release earlier than Release 1.0.03.22:</p><ul><li>RV340 Dual WAN Gigabit VPN Router</li><li>RV340W Dual WAN Gigabit Wireless-AC VPN Router</li><li>RV345 Dual WAN Gigabit VPN Router</li><li>RV345P Dual WAN Gigabit POE VPN Router</li></ul><p>CVE-2021-1602 vulnerability affects the following Cisco Small Business RV Series Routers if they are running firmware releases earlier than 1.0.01.04:</p><ul><li>RV160 VPN Routers</li><li>RV160W Wireless-AC VPN Routers</li><li>RV260 VPN Routers</li><li>RV260P VPN Router with PoE</li><li>RV260W Wireless-AC VPN Routers</li></ul><p>CVE-2021-1572 vulnerability affects the following Cisco products and releases:</p><table><thead><tr><th>Cisco Network Services Orchestrator CLI Secure Shell Server</th><th>ConfD CLI Secure Shell Server</th></tr></thead><tbody><tr><td>Releases 5.4 through 5.4.3.1</td><td>Releases 7.4 through 7.4.3</td></tr><tr><td>Releases 5.5 through 5.5.2.2</td><td>Releases 7.5 through 7.5.2</td></tr></tbody></table><h2 id=\"recommendations\">Recommendations</h2><p>Cisco has released software updates addressing these vulnerabilities [1, 2, 3, 4, 5].</p><p>There is no workaround addressing these vulnerabilities. However, mitigation steps are available for the vulnerability CVE-2021-1602 affecting Cisco NSO and ConfD CLI [4, 5].</p><p>CERT-EU recommends updating vulnerable applications as soon as possible.</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://tools.cisco.com/security/center/publicationListing.x\">https://tools.cisco.com/security/center/publicationListing.x</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-rv340-cmdinj-rcedos-pY8J3qfy\">https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-rv340-cmdinj-rcedos-pY8J3qfy</a></p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-rv-code-execution-9UVJr7k4\">https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-rv-code-execution-9UVJr7k4</a></p><p>[4] <a rel=\"noopener\" target=\"_blank\" href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-nso-priv-esc-XXqRtTfT\">https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-nso-priv-esc-XXqRtTfT</a></p><p>[5] <a rel=\"noopener\" target=\"_blank\" href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-confd-priv-esc-LsGtCRx4\">https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-confd-priv-esc-LsGtCRx4</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  }
}