{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2019-020.pdf"
  },
  "title": "Simjacker Vulnerability Impacting up to 1 Billion Phone Users",
  "serial_number": "2019-020",
  "publish_date": "13-09-2019 16:07:00",
  "description": "AdaptiveMobile Security have uncovered a new and previously undetected vulnerability and associated exploits, called Simjacker. This vulnerability is currently being actively exploited. The main Simjacker attack involves an SMS containing a specific type of spyware-like code being sent to a mobile phone, which then instructs the SIM Card within the phone to \"take over\" the mobile phone to retrieve and perform sensitive commands. During the attack, the user is completely unaware that they received the attack, that information was retrieved, and that it was successfully exfiltrated.",
  "url_title": "2019-020",
  "content_markdown": "---\ntitle: 'Simjacker Vulnerability Impacting up to 1 Billion Phone Users'\nversion: '1.1'\nnumber: '2019-020'\ndate: 'September 16, 2019'\n---\n\n_History:_\n\n* _13/09/2019 --- v1.0 -- Initial publication_\n* _16/09/2019 --- v1.1 -- Added information about potential impact_\n\n# Summary\n\nAdaptiveMobile Security have uncovered a new and previously undetected vulnerability and associated exploits, called Simjacker [1]. This vulnerability is currently being actively exploited. The main **Simjacker** attack involves an SMS containing a specific type of spyware-like code being sent to a mobile phone, which then instructs the SIM Card within the phone to _take over_ the mobile phone to retrieve and perform sensitive commands. During the attack, the user is completely unaware that they received the attack, that information was retrieved, and that it was successfully exfiltrated.\n\n# Technical Details\n\nAccording to [2], the attack begins when a SMS -- _Attack Message_ -- is sent to the targeted handset. It can be sent from another handset, a GSM Modem, or a SMS-sending account connected to an A2P account. The message contains a series of SIM Toolkit (STK) instructions, and is specifically crafted to be passed on to the UICC/eUICC (SIM Card) within the device. In order for these instructions to work, the attack exploits the presence of a particular piece of software, called the **S@T Browser** -- that is on the UICC.  Once the _Attack Message_ is received by the UICC, it uses the S@T Browser library as an execution environment on the UICC, where it can trigger logic on the handset.\n\nFor the main attack observed, the Simjacker code running on the UICC requests location and specific device information (the IMEI) from the handset. Once this information is retrieved, it can be sent to a recipient number via another SMS (the _Data Message_), again by triggering logic on the handset.\n\nAccording to the researchers who identified this vulnerability, they were able to make targeted handsets open up web browsers, ring other phones, send text messages, etc. [2]. These attacks could be used for:\n\n- mis-information (e.g., by sending SMS/MMS messages with attacker controlled content),\n- fraud (e.g., by dialing premium rate numbers, stealing 2FA tokens sent by SMS),\n- espionage (location tracking, but also as a listening device, by ringing a number),\n- malware spreading (by forcing a browser to open a web page with malware)\n- denial of service (e.g by disabling the SIM card)\n- etc.\n\n# Products Affected\n\nMany of possible attacks seems to work independent of handset types, as the vulnerability is dependent on the software on the UICC and not the device itself. Devices from nearly every manufacturer are being successfully targeted to retrieve location: Apple, ZTE, Motorola, Samsung, Google, Huawei, and even IoT devices with SIM cards [2].\n\nUp to potentially 1 billion of devices may be impacted [1].\n\n# Recommendations\n\nUnfortunately, there is nothing that phone users can do to mitigate the attack. Organizations should contact their mobile operators for specific mitigations and solutions.  \n\nThe recommendations for the mobile community to deal with the immediate threat is for mobile operators to analyse and block suspicious messages that contain S@T Browser commands [3]. Mobile Operators could also try to change the security settings of UICCs remotely, or even uninstall and stop using the S@T Browser technology completely, but this may be slower and considerably more difficult to do.\n\n# References\n\n[1] <https://simjacker.com>\n\n[2] <https://www.adaptivemobile.com/blog/simjacker-next-generation-spying-over-mobile>\n\n[2] <https://simalliance.org/wp-content/uploads/2019/08/Security-guidelines-for-S@T-Push-v1.pdf>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>13/09/2019 --- v1.0 -- Initial publication</em></li><li><em>16/09/2019 --- v1.1 -- Added information about potential impact</em></li></ul><h2 id=\"summary\">Summary</h2><p>AdaptiveMobile Security have uncovered a new and previously undetected vulnerability and associated exploits, called Simjacker [1]. This vulnerability is currently being actively exploited. The main <strong>Simjacker</strong> attack involves an SMS containing a specific type of spyware-like code being sent to a mobile phone, which then instructs the SIM Card within the phone to <em>take over</em> the mobile phone to retrieve and perform sensitive commands. During the attack, the user is completely unaware that they received the attack, that information was retrieved, and that it was successfully exfiltrated.</p><h2 id=\"technical-details\">Technical Details</h2><p>According to [2], the attack begins when a SMS -- <em>Attack Message</em> -- is sent to the targeted handset. It can be sent from another handset, a GSM Modem, or a SMS-sending account connected to an A2P account. The message contains a series of SIM Toolkit (STK) instructions, and is specifically crafted to be passed on to the UICC/eUICC (SIM Card) within the device. In order for these instructions to work, the attack exploits the presence of a particular piece of software, called the <strong>S@T Browser</strong> -- that is on the UICC. Once the <em>Attack Message</em> is received by the UICC, it uses the S@T Browser library as an execution environment on the UICC, where it can trigger logic on the handset.</p><p>For the main attack observed, the Simjacker code running on the UICC requests location and specific device information (the IMEI) from the handset. Once this information is retrieved, it can be sent to a recipient number via another SMS (the <em>Data Message</em>), again by triggering logic on the handset.</p><p>According to the researchers who identified this vulnerability, they were able to make targeted handsets open up web browsers, ring other phones, send text messages, etc. [2]. These attacks could be used for:</p><ul><li>mis-information (e.g., by sending SMS/MMS messages with attacker controlled content),</li><li>fraud (e.g., by dialing premium rate numbers, stealing 2FA tokens sent by SMS),</li><li>espionage (location tracking, but also as a listening device, by ringing a number),</li><li>malware spreading (by forcing a browser to open a web page with malware)</li><li>denial of service (e.g by disabling the SIM card)</li><li>etc.</li></ul><h2 id=\"products-affected\">Products Affected</h2><p>Many of possible attacks seems to work independent of handset types, as the vulnerability is dependent on the software on the UICC and not the device itself. Devices from nearly every manufacturer are being successfully targeted to retrieve location: Apple, ZTE, Motorola, Samsung, Google, Huawei, and even IoT devices with SIM cards [2].</p><p>Up to potentially 1 billion of devices may be impacted [1].</p><h2 id=\"recommendations\">Recommendations</h2><p>Unfortunately, there is nothing that phone users can do to mitigate the attack. Organizations should contact their mobile operators for specific mitigations and solutions. </p><p>The recommendations for the mobile community to deal with the immediate threat is for mobile operators to analyse and block suspicious messages that contain S@T Browser commands [3]. Mobile Operators could also try to change the security settings of UICCs remotely, or even uninstall and stop using the S@T Browser technology completely, but this may be slower and considerably more difficult to do.</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://simjacker.com\">https://simjacker.com</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.adaptivemobile.com/blog/simjacker-next-generation-spying-over-mobile\">https://www.adaptivemobile.com/blog/simjacker-next-generation-spying-over-mobile</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://simalliance.org/wp-content/uploads/2019/08/Security-guidelines-for-S@T-Push-v1.pdf\">https://simalliance.org/wp-content/uploads/2019/08/Security-guidelines-for-S@T-Push-v1.pdf</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  }
}