{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2023-048.pdf"
  },
  "title": "Critical Vulnerabilities in SonicWall GMS and Analytics",
  "serial_number": "2023-048",
  "publish_date": "13-07-2023 13:59:02",
  "description": "On July 12, SonicWall released an Urgent Security Notice regarding a suite of vulnerabilities, among which 4 of them rated as critical, affecting SonicWall GMS and Analytics.<br>\nCERT-EU recommends upgrading as soon as possible to the latest version.<br>\n",
  "url_title": "2023-048",
  "content_markdown": "--- \ntitle: 'Critical Vulnerabilities in SonicWall GMS and Analytics'\nversion: '1.0'\nnumber: '2023-048'\noriginal_date: 'July 12, 2023'\ndate: 'July 13, 2023'\n---\n\n_History:_\n\n* _13/07/2023 --- v1.0 -- Initial publication_\n\n# Summary\n\nOn July 12, SonicWall released an Urgent Security Notice regarding a suite of vulnerabilities, among which 4 of them rated as critical, affecting SonicWall GMS and Analytics [1].\n\nCERT-EU recommends upgrading as soon as possible to the latest version.\n\n# Technical Details\n\n**CVE-2023-34124**: This vulnerability with a CVSS score of 9.4 out of 10 could allow an unauthenticated remote attacker to bypass web services authentication mechanisms.\n\n**CVE-2023-34133**: This vulnerability with a CVSS score of 9.8 out of 10 could allow an unauthenticated remote attack to inject SQL commands, and bypass security filters due to an improper neutralisation of special elements used in an SQL command.\n\n**CVE-2023-34134**: This vulnerability with a CVSS score of 9.8 out of 10 could allow a remote attacker to read password hash via web services.\n\n**CVE-2023-34137**:  This vulnerability with a CVSS score of 9.4 out of 10 could allow an unauthenticated remote attacker to bypass CAS authentication mechanisms.\n\n**CVE-2023-34123**: This vulnerability with a CVSS score of 7.5 out of 10 could allow a remote attacker to predict password reset key due to the use of hard-coded cryptographic keys.\n\n**CVE-2023-34126**: This vulnerability with a CVSS score of 7.1 out of 10 could allow an authenticated remote attacker to upload arbitrary files due to insufficient checks.\n\n**CVE-2023-34127**:  This vulnerability with a CVSS score of 8.8 out of 10 could allow an authenticated remote attacker to execute arbitrary commands due to improper neutralisation of special elements used in an OS command.\n\n**CVE-2023-34129**: This vulnerability with a CVSS score of 7.1 out of 10 could allow an authenticated remote attacker to write arbitrary files via web services due to improper limitations of a pathname to a restricted directory.\n\n# Affected Products\n\n- GMS 9.3.2-SP1 and before\n- Analytics 2.5.0.4-R7 and before\n\n# Recommendations\n\nCERT-EU strongly recommends upgrading to the latest versions of SonicWall GMS (`v9.3.3`) and Analytics (`2.5.2`)\n\n# References\n\n[1] <https://www.sonicwall.com/support/knowledge-base/urgent-security-notice-sonicwall-gms-analytics-impacted-by-suite-of-vulnerabilities/230710150218060/> ",
  "content_html": "<p><em>History:</em></p><ul><li><em>13/07/2023 --- v1.0 -- Initial publication</em></li></ul><h2 id=\"summary\">Summary</h2><p>On July 12, SonicWall released an Urgent Security Notice regarding a suite of vulnerabilities, among which 4 of them rated as critical, affecting SonicWall GMS and Analytics [1].</p><p>CERT-EU recommends upgrading as soon as possible to the latest version.</p><h2 id=\"technical-details\">Technical Details</h2><p><strong>CVE-2023-34124</strong>: This vulnerability with a CVSS score of 9.4 out of 10 could allow an unauthenticated remote attacker to bypass web services authentication mechanisms.</p><p><strong>CVE-2023-34133</strong>: This vulnerability with a CVSS score of 9.8 out of 10 could allow an unauthenticated remote attack to inject SQL commands, and bypass security filters due to an improper neutralisation of special elements used in an SQL command.</p><p><strong>CVE-2023-34134</strong>: This vulnerability with a CVSS score of 9.8 out of 10 could allow a remote attacker to read password hash via web services.</p><p><strong>CVE-2023-34137</strong>: This vulnerability with a CVSS score of 9.4 out of 10 could allow an unauthenticated remote attacker to bypass CAS authentication mechanisms.</p><p><strong>CVE-2023-34123</strong>: This vulnerability with a CVSS score of 7.5 out of 10 could allow a remote attacker to predict password reset key due to the use of hard-coded cryptographic keys.</p><p><strong>CVE-2023-34126</strong>: This vulnerability with a CVSS score of 7.1 out of 10 could allow an authenticated remote attacker to upload arbitrary files due to insufficient checks.</p><p><strong>CVE-2023-34127</strong>: This vulnerability with a CVSS score of 8.8 out of 10 could allow an authenticated remote attacker to execute arbitrary commands due to improper neutralisation of special elements used in an OS command.</p><p><strong>CVE-2023-34129</strong>: This vulnerability with a CVSS score of 7.1 out of 10 could allow an authenticated remote attacker to write arbitrary files via web services due to improper limitations of a pathname to a restricted directory.</p><h2 id=\"affected-products\">Affected Products</h2><ul><li>GMS 9.3.2-SP1 and before</li><li>Analytics 2.5.0.4-R7 and before</li></ul><h2 id=\"recommendations\">Recommendations</h2><p>CERT-EU strongly recommends upgrading to the latest versions of SonicWall GMS (<code>v9.3.3</code>) and Analytics (<code>2.5.2</code>)</p><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.sonicwall.com/support/knowledge-base/urgent-security-notice-sonicwall-gms-analytics-impacted-by-suite-of-vulnerabilities/230710150218060/\">https://www.sonicwall.com/support/knowledge-base/urgent-security-notice-sonicwall-gms-analytics-impacted-by-suite-of-vulnerabilities/230710150218060/</a> </p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  }
}