{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2025-002.pdf"
  },
  "title": "Multiple Vulnerabilities in Microsoft Products",
  "serial_number": "2025-002",
  "publish_date": "15-01-2025 13:07:02",
  "description": "On January 14, Microsoft has released its January 2025 Patch Tuesday updates, addressing a total of 159 security vulnerabilities across various products. The patches include fixes for critical and important-severity issues that could allow attackers to gain unauthorised access, execute arbitrary code, or elevate privileges. Three vulnerabilities were already being exploited in attacks.<br>\n",
  "url_title": "2025-002",
  "content_markdown": "---    \ntitle: 'Multiple Vulnerabilities in Microsoft Products'\nnumber: '2025-002'\nversion: '1.0'\noriginal_date: '2025-01-14'\ndate: '2025-01-15'\n---\n\n_History:_\n\n* _15/01/2025 --- v1.0 -- Initial publication_\n\n# Summary\n\nOn January 14, Microsoft has released its January 2025 Patch Tuesday updates, addressing a total of 159 security vulnerabilities across various products [1,2]. The patches include fixes for critical and important-severity issues that could allow attackers to gain unauthorised access, execute arbitrary code, or elevate privileges. Three vulnerabilities were already being exploited in attacks.\n\n# Technical Details\n\nThe eight (8) zero-day vulnerabilities resolved in this update are:\n\n- **CVE-2025-21333**, **CVE-2025-21334**, **CVE-2025-21335**, all with a CVSS score of 7.8, are elevation of privilege vulnerabilities in Windows Hyper-V that were exploited in attacks to gain SYSTEM privileges on Windows devices.\n- **CVE-2025-21275**, with a CVSS score of 7.8, is an elevation of privileges flaw in the Windows App Package Installer that could lead to SYSTEM privileges.\n- **CVE-2025-21308**, with a CVSS score of 6.5, is a spoofing vulnerability in Windows Themes. An attacker could convince a user to load a malicious file onto a vulnerable system and then convince the user to manipulate the specially crafted file, but not necessarily click or open the malicious file. Manipulating the malicious file could allow an attacker exfiltrated NTLM hashes to a remote server.\n- **CVE-2025-21186**, **CVE-2025-21366**, **CVE-2025-21395**, all with a CVSS score of 7.8, are three remote code execution vulnerabilities in Microsoft Access that could be exploited when opening specially crafted Microsoft Access documents.\n\nMicrosoft also released fixes for 12 critical vulnerabilities, including:\n\n- **CVE-2025-21294**, with a CVSS score of 8.1, is a Remote Code Execution vulnerability in Microsoft Digest Authentication.\n- **CVE-2025-21354**, **CVE-2025-21362**, all with a CVSS score of 8.4, are Remote Code Execution vulnerabilities in Microsoft Office Excel.\n- **CVE-2025-21307**, with a CVSS score of 9.8, is a Remote Code Execution vulnerability in the Reliable Multicast Transport driver (RMCAST). An unauthenticated attacker could exploit the vulnerability by sending specially crafted packets to a Windows Pragmatic General Multicast (PGM) open socket on the server, without any interaction from the user. This vulnerability is only exploitable only if there is a program listening on a Pragmatic General Multicast (PGM) port.\n- **CVE-2025-21311**, with a CVSS score of 9.8, is an Elevation of Privilege vulnerability in Windows NTLM V1.\n- **CVE-2025-21298**, with a CVSS score of 9.8, is a Remote Code Execution vulnerability is Windows OLE. Exploitation of the vulnerability might involve either a victim opening a specially crafted email with an affected version of Microsoft Outlook software, or a victim's Outlook application displaying a preview of a specially crafted email.\n- **CVE-2025-21309**, **CVE-2025-21297**, all with a CVSS score of 8.1, are Remote Code Execution vulnerabilities in Windows Remote Desktop Services. An attacker could successfully exploit this vulnerability by connecting to a system with the Remote Desktop Gateway role, triggering the race condition to create a use-after-free scenario, and then leveraging this to execute arbitrary code.\n\n# Affected Products\n\nThese vulnerabilities affect Windows Operating Systems and applications. Please refer to the vendor advisory for an exhaustive list of affected products [2].\n\n# Recommendations\n\nIt is recommended applying security updates as soon as possible, prioritising vulnerabilities with high scores and publicly exposed assets.\n\n##  Workarounds\n\nSome workarounds are provided by the vendor:\n\n- In general, but specifically for the vulnerability **CVE-2025-21308**, it is recommended disabling NTLM authentication (if possible), or enabling the \"Restrict NTLM: Outgoing NTLM traffic to remote servers\" policy.\n- In, general, but specifically for the vulnerability **CVE-2025-21311**, it is recommended to set the `LmCompatabilityLvl` to its maximum value (5) for all machines. This will prevent the usage of the older NTLMv1 protocol, while still allowing NTLMv2 [3].\n- In general, but specifically for **CVE-2025-21298**, Microsoft recommends users read email messages in plain text format. However, this will have an impact on the ability to read email messages in HTML format.\n\n# References\n\n[1] <https://www.bleepingcomputer.com/news/microsoft/microsoft-january-2025-patch-tuesday-fixes-8-zero-days-159-flaws/>\n\n[2] <https://msrc.microsoft.com/update-guide/releaseNote/2025-Jan>\n\n[3] <https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level>\n",
  "content_html": "<p><em>History:</em></p><ul><li><em>15/01/2025 --- v1.0 -- Initial publication</em></li></ul><h2 id=\"summary\">Summary</h2><p>On January 14, Microsoft has released its January 2025 Patch Tuesday updates, addressing a total of 159 security vulnerabilities across various products [1,2]. The patches include fixes for critical and important-severity issues that could allow attackers to gain unauthorised access, execute arbitrary code, or elevate privileges. Three vulnerabilities were already being exploited in attacks.</p><h2 id=\"technical-details\">Technical Details</h2><p>The eight (8) zero-day vulnerabilities resolved in this update are:</p><ul><li><strong>CVE-2025-21333</strong>, <strong>CVE-2025-21334</strong>, <strong>CVE-2025-21335</strong>, all with a CVSS score of 7.8, are elevation of privilege vulnerabilities in Windows Hyper-V that were exploited in attacks to gain SYSTEM privileges on Windows devices.</li><li><strong>CVE-2025-21275</strong>, with a CVSS score of 7.8, is an elevation of privileges flaw in the Windows App Package Installer that could lead to SYSTEM privileges.</li><li><strong>CVE-2025-21308</strong>, with a CVSS score of 6.5, is a spoofing vulnerability in Windows Themes. An attacker could convince a user to load a malicious file onto a vulnerable system and then convince the user to manipulate the specially crafted file, but not necessarily click or open the malicious file. Manipulating the malicious file could allow an attacker exfiltrated NTLM hashes to a remote server.</li><li><strong>CVE-2025-21186</strong>, <strong>CVE-2025-21366</strong>, <strong>CVE-2025-21395</strong>, all with a CVSS score of 7.8, are three remote code execution vulnerabilities in Microsoft Access that could be exploited when opening specially crafted Microsoft Access documents.</li></ul><p>Microsoft also released fixes for 12 critical vulnerabilities, including:</p><ul><li><strong>CVE-2025-21294</strong>, with a CVSS score of 8.1, is a Remote Code Execution vulnerability in Microsoft Digest Authentication.</li><li><strong>CVE-2025-21354</strong>, <strong>CVE-2025-21362</strong>, all with a CVSS score of 8.4, are Remote Code Execution vulnerabilities in Microsoft Office Excel.</li><li><strong>CVE-2025-21307</strong>, with a CVSS score of 9.8, is a Remote Code Execution vulnerability in the Reliable Multicast Transport driver (RMCAST). An unauthenticated attacker could exploit the vulnerability by sending specially crafted packets to a Windows Pragmatic General Multicast (PGM) open socket on the server, without any interaction from the user. This vulnerability is only exploitable only if there is a program listening on a Pragmatic General Multicast (PGM) port.</li><li><strong>CVE-2025-21311</strong>, with a CVSS score of 9.8, is an Elevation of Privilege vulnerability in Windows NTLM V1.</li><li><strong>CVE-2025-21298</strong>, with a CVSS score of 9.8, is a Remote Code Execution vulnerability is Windows OLE. Exploitation of the vulnerability might involve either a victim opening a specially crafted email with an affected version of Microsoft Outlook software, or a victim's Outlook application displaying a preview of a specially crafted email.</li><li><strong>CVE-2025-21309</strong>, <strong>CVE-2025-21297</strong>, all with a CVSS score of 8.1, are Remote Code Execution vulnerabilities in Windows Remote Desktop Services. An attacker could successfully exploit this vulnerability by connecting to a system with the Remote Desktop Gateway role, triggering the race condition to create a use-after-free scenario, and then leveraging this to execute arbitrary code.</li></ul><h2 id=\"affected-products\">Affected Products</h2><p>These vulnerabilities affect Windows Operating Systems and applications. Please refer to the vendor advisory for an exhaustive list of affected products [2].</p><h2 id=\"recommendations\">Recommendations</h2><p>It is recommended applying security updates as soon as possible, prioritising vulnerabilities with high scores and publicly exposed assets.</p><h3 id=\"workarounds\">Workarounds</h3><p>Some workarounds are provided by the vendor:</p><ul><li>In general, but specifically for the vulnerability <strong>CVE-2025-21308</strong>, it is recommended disabling NTLM authentication (if possible), or enabling the \"Restrict NTLM: Outgoing NTLM traffic to remote servers\" policy.</li><li>In, general, but specifically for the vulnerability <strong>CVE-2025-21311</strong>, it is recommended to set the <code>LmCompatabilityLvl</code> to its maximum value (5) for all machines. This will prevent the usage of the older NTLMv1 protocol, while still allowing NTLMv2 [3].</li><li>In general, but specifically for <strong>CVE-2025-21298</strong>, Microsoft recommends users read email messages in plain text format. However, this will have an impact on the ability to read email messages in HTML format.</li></ul><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-january-2025-patch-tuesday-fixes-8-zero-days-159-flaws/\">https://www.bleepingcomputer.com/news/microsoft/microsoft-january-2025-patch-tuesday-fixes-8-zero-days-159-flaws/</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/update-guide/releaseNote/2025-Jan\">https://msrc.microsoft.com/update-guide/releaseNote/2025-Jan</a></p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level\">https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/security-policy-settings/network-security-lan-manager-authentication-level</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  },
  "cves": [
    "CVE-2025-21186",
    "CVE-2025-21275",
    "CVE-2025-21294",
    "CVE-2025-21297",
    "CVE-2025-21298",
    "CVE-2025-21307",
    "CVE-2025-21308",
    "CVE-2025-21309",
    "CVE-2025-21311",
    "CVE-2025-21333",
    "CVE-2025-21334",
    "CVE-2025-21335",
    "CVE-2025-21354",
    "CVE-2025-21362",
    "CVE-2025-21366",
    "CVE-2025-21395"
  ]
}