{
  "file_item": {
    "filepath": "security-advisories",
    "filename": "CERT-EU-SA2025-030.pdf"
  },
  "title": "High Severity Vulnerability in Microsoft Exchange ",
  "serial_number": "2025-030",
  "publish_date": "08-08-2025 12:37:23",
  "description": "On August 6, 2025, Microsoft issued an advisory for a high-severity vulnerability affecting Microsoft Exchange hybrid environments. The vulnerability tracked as CVE-2025-53786 allows an attacker with administrative access to an on-premises Exchange Server to escalate privileges into the connected Exchange Online environment. The vulnerability can impact the confidentiality, integrity, and availability of affected systems.<br>\n",
  "url_title": "2025-030",
  "content_markdown": "---    \ntitle: 'High Severity Vulnerability in Microsoft Exchange '\nnumber: '2025-030'\nversion: '1.1'\noriginal_date: '2025-08-06'\ndate: '2025-08-08'\n---\n\n_History:_\n\n* _08/08/2025 --- v1.0 -- Initial publication_\n* _08/08/2025 --- v1.1 -- Updated information_\n\n# Summary\n\nOn August 6, 2025, Microsoft issued an advisory for a high-severity vulnerability affecting Microsoft Exchange hybrid environments [1]. The vulnerability tracked as **CVE-2025-53786** allows an attacker with administrative access to an on-premises Exchange Server to escalate privileges into the connected Exchange Online environment. The vulnerability can impact the confidentiality, integrity, and availability of affected systems.\n\n# Technical Details\n\nAn attacker with admin privileges on an on-premise Exchange server can potentially forge or manipulate trusted tokens or API calls that the cloud side will accept as legitimate. This technique allows the attackers to spread laterally from the local network into the organisation's cloud environment, potentially compromising the organisation's entire active directory and infrastructure [6].\n\n# Products Affected\n\nThe vulnerability affects the following Microsoft Exchange Servers in Hybrid Exchange Deployments:\n\n- Microsoft Exchange Server 2016 Cumulative Update 23 versions earlier than 15.01.2507.055\n- Microsoft Exchange Server 2019 Cumulative Update 14 versions earlier than 15.02.1544.025\n- Microsoft Exchange Server 2019 Cumulative Update 15 versions earlier than 15.02.1748.024\n- Microsoft Exchange Server Subscription Edition RTM versions earlier than 15.02.2562.017\n\n# Recommendations\n\nIt is strongly recommended to apply the follow the vendor guidance [1]:\n\n- If using Exchange hybrid, review Microsoft's guidance to determine if your Microsoft hybrid deployments are potentially affected and available for a Cumulative Update (CU) [2].\n\n- Install Microsoft’s April 2025 Exchange Server Hotfix Updates [3] on the on-premise Exchange server and follow Microsoft's configuration instructions to deploy the dedicated Exchange hybrid app [4].\n\n- For organisations using Exchange hybrid (or have previously configured Exchange hybrid but no longer use it), review Microsoft's Service Principal Clean-Up Mode [4] for guidance on resetting the service principal's `keyCredentials`.\n\n- Upon completion, run the Microsoft Exchange Health Checker [5] to determine if further steps are required. \n\n## Threat Hunting\n\nThe KQL query below detects potential abuse of the `graph.windows.net` API through impersonation — later fixed by Microsoft [7].\n\n```\nAuditLogs\n| where not(OperationName has \"group\")\n| where not(OperationName == \"Set directory feature on tenant\")\n| where InitiatedBy has_all ( \"Office 365 Exchange Online\",\"user\")\n| where InitiatedBy.user.displayName == \"Office 365 Exchange Online\"\n```\n\n# References\n\n[1] <https://msrc.microsoft.com/update-guide/advisory/CVE-2025-53786>\n\n[2] <https://techcommunity.microsoft.com/blog/exchange/exchange-server-security-changes-for-hybrid-deployments/4396833>\n\n[3] <https://techcommunity.microsoft.com/blog/exchange/released-april-2025-exchange-server-hotfix-updates/4402471>\n\n[4] <https://learn.microsoft.com/en-us/Exchange/hybrid-deployment/deploy-dedicated-hybrid-app>\n\n[5] <https://microsoft.github.io/CSS-Exchange/Diagnostics/HealthChecker/>\n\n[6] <https://www.bleepingcomputer.com/news/security/cisa-orders-fed-agencies-to-patch-new-cve-2025-53786-exchange-flaw/>\n\n[7] <https://i.blackhat.com/BH-USA-25/Presentations/US-25-Mollema-Advanced-AD-to-Entra-ID-lateral-movement-techniques-Wednesday.pdf>",
  "content_html": "<p><em>History:</em></p><ul><li><em>08/08/2025 --- v1.0 -- Initial publication</em></li><li><em>08/08/2025 --- v1.1 -- Updated information</em></li></ul><h2 id=\"summary\">Summary</h2><p>On August 6, 2025, Microsoft issued an advisory for a high-severity vulnerability affecting Microsoft Exchange hybrid environments [1]. The vulnerability tracked as <strong>CVE-2025-53786</strong> allows an attacker with administrative access to an on-premises Exchange Server to escalate privileges into the connected Exchange Online environment. The vulnerability can impact the confidentiality, integrity, and availability of affected systems.</p><h2 id=\"technical-details\">Technical Details</h2><p>An attacker with admin privileges on an on-premise Exchange server can potentially forge or manipulate trusted tokens or API calls that the cloud side will accept as legitimate. This technique allows the attackers to spread laterally from the local network into the organisation's cloud environment, potentially compromising the organisation's entire active directory and infrastructure [6].</p><h2 id=\"products-affected\">Products Affected</h2><p>The vulnerability affects the following Microsoft Exchange Servers in Hybrid Exchange Deployments:</p><ul><li>Microsoft Exchange Server 2016 Cumulative Update 23 versions earlier than 15.01.2507.055</li><li>Microsoft Exchange Server 2019 Cumulative Update 14 versions earlier than 15.02.1544.025</li><li>Microsoft Exchange Server 2019 Cumulative Update 15 versions earlier than 15.02.1748.024</li><li>Microsoft Exchange Server Subscription Edition RTM versions earlier than 15.02.2562.017</li></ul><h2 id=\"recommendations\">Recommendations</h2><p>It is strongly recommended to apply the follow the vendor guidance [1]:</p><ul><li><p>If using Exchange hybrid, review Microsoft's guidance to determine if your Microsoft hybrid deployments are potentially affected and available for a Cumulative Update (CU) [2].</p></li><li><p>Install Microsoft’s April 2025 Exchange Server Hotfix Updates [3] on the on-premise Exchange server and follow Microsoft's configuration instructions to deploy the dedicated Exchange hybrid app [4].</p></li><li><p>For organisations using Exchange hybrid (or have previously configured Exchange hybrid but no longer use it), review Microsoft's Service Principal Clean-Up Mode [4] for guidance on resetting the service principal's <code>keyCredentials</code>.</p></li><li><p>Upon completion, run the Microsoft Exchange Health Checker [5] to determine if further steps are required. </p></li></ul><h3 id=\"threat-hunting\">Threat Hunting</h3><p>The KQL query below detects potential abuse of the <code>graph.windows.net</code> API through impersonation — later fixed by Microsoft [7].</p><pre><code>AuditLogs\n| where not(OperationName has \"group\")\n| where not(OperationName == \"Set directory feature on tenant\")\n| where InitiatedBy has_all ( \"Office 365 Exchange Online\",\"user\")\n| where InitiatedBy.user.displayName == \"Office 365 Exchange Online\"\n</code></pre><h2 id=\"references\">References</h2><p>[1] <a rel=\"noopener\" target=\"_blank\" href=\"https://msrc.microsoft.com/update-guide/advisory/CVE-2025-53786\">https://msrc.microsoft.com/update-guide/advisory/CVE-2025-53786</a></p><p>[2] <a rel=\"noopener\" target=\"_blank\" href=\"https://techcommunity.microsoft.com/blog/exchange/exchange-server-security-changes-for-hybrid-deployments/4396833\">https://techcommunity.microsoft.com/blog/exchange/exchange-server-security-changes-for-hybrid-deployments/4396833</a></p><p>[3] <a rel=\"noopener\" target=\"_blank\" href=\"https://techcommunity.microsoft.com/blog/exchange/released-april-2025-exchange-server-hotfix-updates/4402471\">https://techcommunity.microsoft.com/blog/exchange/released-april-2025-exchange-server-hotfix-updates/4402471</a></p><p>[4] <a rel=\"noopener\" target=\"_blank\" href=\"https://learn.microsoft.com/en-us/Exchange/hybrid-deployment/deploy-dedicated-hybrid-app\">https://learn.microsoft.com/en-us/Exchange/hybrid-deployment/deploy-dedicated-hybrid-app</a></p><p>[5] <a rel=\"noopener\" target=\"_blank\" href=\"https://microsoft.github.io/CSS-Exchange/Diagnostics/HealthChecker/\">https://microsoft.github.io/CSS-Exchange/Diagnostics/HealthChecker/</a></p><p>[6] <a rel=\"noopener\" target=\"_blank\" href=\"https://www.bleepingcomputer.com/news/security/cisa-orders-fed-agencies-to-patch-new-cve-2025-53786-exchange-flaw/\">https://www.bleepingcomputer.com/news/security/cisa-orders-fed-agencies-to-patch-new-cve-2025-53786-exchange-flaw/</a></p><p>[7] <a rel=\"noopener\" target=\"_blank\" href=\"https://i.blackhat.com/BH-USA-25/Presentations/US-25-Mollema-Advanced-AD-to-Entra-ID-lateral-movement-techniques-Wednesday.pdf\">https://i.blackhat.com/BH-USA-25/Presentations/US-25-Mollema-Advanced-AD-to-Entra-ID-lateral-movement-techniques-Wednesday.pdf</a></p>",
  "licence": {
    "title": "Creative Commons Attribution 4.0 International (CC-BY 4.0)",
    "link": "https://creativecommons.org/licenses/by/4.0/",
    "restrictions": "https://cert.europa.eu/legal-notice",
    "author": "The Cybersecurity Service for the Union institutions, bodies, offices and agencies"
  },
  "cves": [
    "CVE-2025-53786"
  ]
}